[
    {
        "serial": 1,
        "name": "THE PHOTOGRAPHY CLUB",
        "description": "Photography Club provides a platform for all photographers to share their ideas, artistic vision, artistic photography, technical knowledge, spirit, enthusiasm with the public. Club promote an interest in all aspects of photography as an art throughout the campus, through exhibition and public events. Promote creativity through photography, to share and critique the photographs of peers, to educate and improve technical skills, and to spread the love of photography throughout the student community. Having an in group critique of photographs that members have taken. Organise various workshops and competitions for enhancing the skill of its members.",
        "img_path": "PHOTOGRAPHY.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/the-photography-club-vit",
            "instagram": "https://www.instagram.com/photographyclubvit/",
            "facebook": "https://www.facebook.com/thephotographyclubvit/"
        }
    },
    {
        "serial": 2,
        "name": "COMMUNITY RADIO",
        "description": "VIT Community Radio (Teamspeak) Vellore First Community Radio Station, for the empowerment of the community people who lives in and around the VIT campus. This is the radio under the frequency of 90.8. Basically, we aim to uplift the community people through our small attempt of speaking in the radio. It also helps VIT people for equipping themselves in-terms of personal and career. Here we do live shows, where we try to bring out everything about the world under the one roof for benefiting the people. We cover the events in VIT, there we interview the participants, external people and guests. During fests, we take live bytes from the students, faculties, guests etc. We also conduct some outreach programs for the benefit of the community people. We speak the voice of the people.",
        "img_path": "COMMUNITY RADIO.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitradio/",
            "facebook": "https://www.facebook.com/vitcommunityradio/"
        }
    },
    {
        "serial": 3,
        "name": "VIT FILM SOCIETY (VFS)",
        "description": "Film Society promote awareness about the actual cinema and that will judge the students ability to understand the movie. To learn the basic skills in film making, script writing, editing, video coverage etc. Club is mainly learning through entertainment. The activities encourage students to develop a different perception regarding the films. The movies managerial skills like leadership, team spirit, group dynamics, creativity, self-motivation etc are developed by the way of film making sessions. Scripting, Shooting, Lighting, editing, sound mixing etc are the part of the club activity. At a regular basis, organize quality events like workshops on script-writing, cinematography, movie-making, movie-analysis and other activities related to appreciation of films. Promote group discussions and panel discussions in the presence of technical experts in the area of movie making with the intent of imbibing taste for quality films.",
        "img_path": "FILM SOCIETY.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitfilmsociety/?hl=en",
            "youtube": "https://www.youtube.com/c/VITFilmSociety/",
            "linkedin": "https://in.linkedin.com/company/vitfilmsociety",
            "facebook": "https://www.facebook.com/VITFilmSociety/",
            "website": "https://vitfilmsocietyvlr.wixsite.com/vfsvellore"
        }
    },
    {
        "serial": 4,
        "name": "MALAYALAM LITERARY ASSOCIATION (MLA)",
        "description": "Malayalam Literary Association (Thanima-MLA) is a literary club, by the Keralites of Vellore Institute of Technology. We are a club who thrives to preserve, promote, and uplift the rich, old traditions, cultures, and language of Kerala. In MLA, we help our members to develop their knowledge more on their mother tongue, Malayalam, by conducting weekly events, wherein each and every member have a chance to learn, interact, showcase their literary skills and converse with their peers. We promote Malayalam literature to help other students interested in Malayalam history and literature through these weekly events, be it debates on Malayalam literature, Just a Minute, literary crosswords, Turn Coats and many more, we train our members for competitions and fests. Through so, we all develop a strong bond amongst each other, making MLA, not just a club, but also a family.",
        "img_path": "MALAYALAM LITERARY ASSOCIATION.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/malayalam-literary-association",
            "instagram": "https://www.instagram.com/mla_oruma/?hl=en",
            "youtube": "https://youtube.com/@malayalamliteraryassociation?si=Cp93ksklc17B7FUz",
            "facebook": "https://www.facebook.com/mlathanima/"
        }
    },
    {
        "serial": 5,
        "name": "SMILE OVER STRESS (SOS)",
        "description": "The SoS Club thrive to be a group that works towards establishing a community that understands mental health. Members do this by breaking stereotypes that surround Mental Health. Through innovative means, spread awareness about mental health and its effects and help students overcome these by coming up with an action plan.",
        "img_path": "SMILE OVER STRESS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/sos_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/smile-over-stress-sos-vit",
            "facebook": "https://www.facebook.com/sosvitofficial/"
        }
    },
    {
        "serial": 6,
        "name": "DEBATE SOCIETY",
        "description": "The Debate Society is the place to be if you want to test your mettle in the art of debating. Armed with logic & a love for the spoken word, we battle it out in a myriad of topics from the world of pop culture to the realms of international affairs & economics. We promote a culture of greater thought, and free but inoffensive speech. We encourage the student body to engage with the bigger questions - political, social and cultural - and to see the basis for varied viewpoints and multiple valid opinions. The club has left an indelible mark on the Indian debating circuit as a whole by being a tour-de-force at every tournament it attends, breaking at & winning most of them. From organising events like DebScope to running our intra-VIT tournament 'MAKA,' DebSoc offers everything a person with an interest in debating could ever want.",
        "img_path": "DEBSOC – VIT.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitdebsoc/?hl=en",
            "linkedin": "https://in.linkedin.com/company/debate-society-vit",
            "facebook": "https://www.facebook.com/vitdebsoc/"
        }
    },
    {
        "serial": 7,
        "name": "ANIMATION CLUB",
        "description": "VIT Animation Club promotes animation as a viable art form and to expose the general public to this Art form. The aim of the club is to express the creative pragmatist mind set of those who want to think \"Out Of the Box\". Club groom the designers all across VIT, who not just contain talent in areas in their specific domains but also have an enthusiasm to learn more in the field of animation. Sometimes it isn't always your skills put into action that almost everybody will be talking about today, but the thought that you channel inside you and follow your heart. You can only do well if you lead your soul, your passion with sheer determination, so that when the time comes you do what you can and dazzle us with the skills you had acquired throughout. Club organizes workshop in different areas of animation.",
        "img_path": "VIT ANIMATION.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "facebook": "https://www.facebook.com/vitanimationclub/",
            "youtube": "https://www.youtube.com/c/vitanimationclub",
            "instagram": "https://www.instagram.com/vit_animation/",
            "website": "https://vitanimation.netlify.app/",
            "linkedin": "https://in.linkedin.com/company/vit-animation"
        }
    },
    {
        "serial": 8,
        "name": "TEDXVIT",
        "description": "TEDx promote the ideas that are shared on stage and to facilitate a conversation between thinkers, doers and Change makers. A global community, welcoming people from every discipline and culture who seek a deeper understanding of the world. We believe passionately in the power of ideas to change attitudes, lives and, ultimately, the world. We're building a clearinghouse of free knowledge from the world's most inspired thinkers and a community of curious souls to engage with ideas and each other around the world, all year long. We organise conference where Technology, Entertainment and Design converged, and today covers almost all topics, from science to business to global issues. These events help share ideas in communities around the world.",
        "img_path": "TEDXVIT.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "website": "https://tedxvit.com/",
            "linkedin": "https://in.linkedin.com/company/tedx-vitvellore",
            "medium": "https://medium.com/tedxvitvellore",
            "facebook": "https://www.facebook.com/Tedxvitvellore/",
            "twitter": "https://x.com/TEDxVITVellore",
            "discord": "https://discord.com/invite/wjg7gx88yc",
            "instagram": "https://www.instagram.com/tedxvitvellore/"
        }
    },
    {
        "serial": 9,
        "name": "FEP - SI",
        "description": "FEPSI was conceived with the vision of redefining change starting from a small scale and then increasing its momentum. FEPSI’s vision to transform the world into an ideal place to live sustainably by empowering the people is through innovative methods. FEPSI is a youth driven organization working towards a fairer, more egalitarian society. As an active organization of students of VIT, FEPSI has reached out to hundreds of children and the emerging youth-approaching-adulthood. We at FEPSI bridge the gap between entertainment and social service. Through our innovative ideas we are able to connect with hundreds of youths making them help the society indirectly via keeping them involved in the things which interests them",
        "img_path": "FEPSI.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/fep-si",
            "instagram": "https://www.instagram.com/fepsi.india/?hl=en",
            "facebook": "https://www.facebook.com/fepsi.india/",
            "twitter": "https://x.com/fepsi_vit"
        }
    },
    {
        "serial": 10,
        "name": "THE ELECTRONICS CLUB (TEC)",
        "description": "The Electronics Club (TEC) aims to provide students a platform and resources to gain practical skills and realize projects. We strive to teach and help students acquire new skills in an era of rapidly evolving technology. We believe in coming up with projects that are innovative and tackle real life problems. We help students to acquire and develop new skill-sets by conducting various lectures and workshops and mentorship programs to help students realize their projects. The mission of the club is to expose students to challenges and new technologies in the field of electronics and thus to nurture and develop their skill set in this arena. Regular meetings and mentorship programs will definitely help students to achieve their goals. The emphasis is on experimenting and learning, no experience is necessary but eagerness to learn is essential.",
        "img_path": "TEC.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://tecvit.in/",
            "medium": "https://tec-vit.medium.com/",
            "linkedin": "https://www.linkedin.com/company/the-electronics-club-vit/",
            "instagram": "https://www.instagram.com/tec.vit/",
            "facebook": "https://www.facebook.com/tec.vit/",
            "github": "https://github.com/TEC-VIT",
            "discord": "https://discord.com/invite/KpuaP2nCXj"
        }
    },
    {
        "serial": 11,
        "name": "INNOVATOR'S QUEST",
        "description": "Innovators Quest provide students a platform to update their knowledge base with all the latest techniques and concepts so as to make the youth technically sound, but also encourage a healthy exchange of ideas. Our main objective is to mould people towards a more professional pedestal in their field of interest and develop a wider ambit of ideas with a positive outlook on research through numerous workshops and guest lectures. We facilitate the knowledge sharing and skill development activities through seminars and hands on workshops in the Architecture related areas like digital architecture, visual merchandising, model making, spatial ideation exercises, graphical manifestation creations - execution works.",
        "img_path": "INNOVATOR'S QUEST.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/iquest.vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/innovatorsquest",
            "facebook": "https://www.facebook.com/InnovatorsQuest/"
        }
    },
    {
        "serial": 12,
        "name": "TECHNOLOGY AND GAMING CLUB (TAG)",
        "description": "Technology and Gaming Club (TAG) in Vellore Institute of Technology aims at instilling a gaming environment for all the digital players out there along with helping them shape their interest in Game development. To facilitate the development of skills pertaining to game development (cyber games) and other important spheres of modern computing to give the student community in VIT a competitive edge in modern computing industry. TAG helps to perpetuate professional game-testing as a career option among the student community. Various workshops like Studio to Stage, Henry Harvin has moulded TAG in taking steps towards inculcating the Gaming world in VIT. TAG provides quality technical, design and gaming extravaganzas every year.",
        "img_path": "TAG.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/tagclub.vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/tag-club-vit",
            "github": "https://github.com/Technology-And-Gaming-Club"
        }
    },
    {
        "serial": 13,
        "name": "THE HINDU EDUCATION PLUS CLUB (THEPC)",
        "description": "The Hindu Education Plus Club (THEP) is an initiative of the prestigious newspaper - The Hindu. Recognizing the importance of excellent communication skills, sound reasoning, and the confidence to present one's ideas and opinions clearly. The club's activities are organized to make the process of learning English and increasing vocabulary an enjoyable endeavour. The club is structured so as to make the prospect of learning exemplary literary skills through umpteen activities and competitions to increase student involvement. Our club undertakes activities that help students improve their English, their debating and writing skills, etc. These activities confidence of students, give them a potent platform where they can practice and communicate without any inhibitions, and impart industry-specific skills. Moreover, it motivates the students to think logically, express themselves with clarity and confidence, and work well in a team.",
        "img_path": "THEP.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/thepc_vit/?hl=en",
            "facebook": "https://www.facebook.com/vitthehindueplusclub/",
            "website": "https://www.thepcvit.com/",
            "linkedin": "https://in.linkedin.com/school/the-hindu-education-plus-club/"
        }
    },
    {
        "serial": 14,
        "name": "TELUGU LITERARY ASSOCIATION (SAHITI)",
        "description": "Telugu Literary Association (Sahithi) is a student club in VIT which is focused on promoting Telugu literature among the Telugu community In VIT. Club provides a platform to Telugu students to showcase their literary skills. To help other students who are interested in Telugu Literature and History gain an insight into the same. For that, various events are organised in Telugu literary and history. Literary competitions are held which include poetry, script writing, story writing, etc. to promote Telugu language.",
        "img_path": "SAHITI.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/sahiti_tla/?hl=en",
            "linkedin": "https://in.linkedin.com/company/sahiti-tla-vit",
            "facebook": "https://www.facebook.com/sahiti.vit/",
            "youtube": "https://youtube.com/@sahititlavit4066"
        }
    },
    {
        "serial": 15,
        "name": "AYUDA",
        "description": "Ayuda is a youth led organization working for improved health of masses, eradication of illiteracy and providing assistance to old. We at Ayuda proceed forward with the common goal to work for the upliftment of the society and bring sustainable changes in the lives of old and underprivileged children. We also conduct various health related campaigns and teaching workshops in underprivileged schools and villages on regular basis. We firmly believe that “Every life is a blessing and a hope for mankind” and thus we strive to nurture the seeds of growth. The NGO conducts 5 projects which include: Project Gyaan- Educational Outreach, Project Muskaan- Spread Joy, Project Sudhaar- Accessible Healthcare, Project Nirmaan- Infrastructure Development in Schools, Project Go Green- Planting Trees for a Cleaner Future.",
        "img_path": "AYUDA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/ayuda.ngo/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ayuda-ngo",
            "medium": "https://medium.com/ayuda-ngo",
            "website": "https://linktr.ee/ayudango",
            "facebook": "https://www.facebook.com/ngoayuda/",
            "youtube": "https://www.youtube.com/@ayudango4843"
        }
    },
    {
        "serial": 16,
        "name": "DESIGN CLUB - PIXELATE",
        "description": "To train designers in the fields of graphic design, Ul design, UX design and animation, interaction design, product design and branding. To help designers gain knowledge about design principles and guidelines. To increase the overall design standards in internal events by partnering with other clubs, chapters and start ups in VIT who lack design resources for their events or workshops. To represent VIT in design hackathons and events in various colleges all over India. 5. Discover and recruit design enthusiasts and creative minds in VIT and bring them under one roof. 6. To provide support and design advice to students wishing to pursue designing, HCI or User Experience as a career after college.",
        "img_path": "PIXELATE.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/pixelatevit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/pixelatee"
        }
    },
    {
        "serial": 17,
        "name": "GUJARATI LITERARY ASSOCIATION (GLA)",
        "description": "The Gujarathi Literary Association (GLA) strives to hone the all-round talents of an individual who wishes to master the Gujarathi language. It facilitates a variety of events that engage you as an audience and a participant. GLA possesses the seriousness associated to promote Gujarathi Literature. To provide a platform for students to showcase their Gujarathi literary skills. To help other students who are interested in Gujarathi literature and history gain an insight into the same with fun, energy and enthusiasm. GLA hosts events like to promote Gujarathi literature and a lot more events which serve as great platforms for the students of VIT to exhibit their talents.",
        "img_path": "GUJARATI LITERARY ASSOCIATION.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/gla_vit/",
            "facebook": "https://www.facebook.com/gla.vitu/"
        }
    },
    {
        "serial": 18,
        "name": "ZERO WASTE MANAGEMENT (ZWM)",
        "description": "Zero Waste Mangement club promotes and develop sustainable and professional Waste Management system in campus. Club achieves its mission through: Promoting resource efficiency through sustainable production and consumption, Advancement of waste management through education and training. Promoting appropriate and best available technologies and practices. Organize events to share knowledge and experience in sustainable waste management and climate change mitigation. Also all kinds of professional events for the dissemination of information.",
        "img_path": "ZERO WASTE MANAGEMENT CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL",
            "ENVIRONMENTAL_SUSTAINABILITY"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/zwm_vit_vellore/",
            "linkedin": "https://in.linkedin.com/company/zero-waste-management-club",
            "facebook": "https://www.facebook.com/zwm.v.vellore",
            "medium": "https://medium.com/@zerowastezwmvitvellore"
        }
    },
    {
        "serial": 19,
        "name": "VISUAL BLOGGER'S CLUB",
        "description": "Visual Blogger’s Club provide a platform for aspiring and existing visual bloggers in VIT, to encourage writing visual blogs, to encourage people to express their idea and thoughts by visual blogging. Visual blogging is a type of content blogging that connects with readers using visual content like images, infographics and mini-infographics. If you want to steadily improve your post virality and sharability, then you should look into adding some visual post styles to your strategy. Visual blogging posts can also include infographics, memes, mini-infographics and stylized images. The club organises various workshops and events to help students in the world of blogging.",
        "img_path": "VISUAL BLOGGER'S.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vbc_vit/",
            "linkedin": "https://www.linkedin.com/company/visual-bloggers-club-vit",
            "facebook": "https://www.facebook.com/vbcvit/",
            "twitter": "https://x.com/vbcvit"
        }
    },
    {
        "serial": 20,
        "name": "STUDENTS ASSOCIATION OF BIO-ENGINEERING SCIENCE AND TECHNOLOGY (SABEST)",
        "description": "SABEST: The Students Association of Bio-Engineering, Science and Technology aims at inculcating a burgeoning flair and passion for revolutionary ideas among its members through the means of constructive group discussion and inspiring guest lectures to the comprising members. It makes the students aware of the resent happenings and ground breaking research relevant to the field. Club strives to increase the holistic growth and development of the students. Also recognises and appreciates that each student in an individual entity, with boundless creativity and graceful intellect, that all students need only a platform to prove themselves and hone their skills. Club provides them that whetstone to sharpen their skillset on and show their creativity and talent in the field of science and technology.",
        "img_path": "SABEST.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/sabest-student-association-of-bioengineering-science-technology",
            "instagram": "https://www.instagram.com/sabest_vit/?hl=en",
            "facebook": "https://www.facebook.com/vitsabest/"
        }
    },
    {
        "serial": 21,
        "name": "DIGIT SQUAD",
        "description": "The club is of premier technology enthusiasts in VIT, who practically live and sense all things technology. Not only to learn how to manufacture and work in the industry of tech but the club would practically want to see people use technology in the best way possible. Getting the most out of technology in the right way is our vision. For the past 15 years, Digit is the most trusted friend when it comes to everything you may want to know and find about technology and science. Our club would hence strive to further teach people how technology can be used for an optimal life solution and also enriching the quality of life's impact due to technology through events, social media posts, engaging quizzes, and newsletters.",
        "img_path": "DIGIT SQUAD.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/digitsquad_vit/?hl=en",
            "discord": "https://discord.com/invite/HVDNQnX5yh",
            "linkedin": "https://in.linkedin.com/company/digitsquadvitv",
            "facebook": "https://www.facebook.com/digitsquadvitv/"
        }
    },
    {
        "serial": 22,
        "name": "VIT MODEL UNITED NATIONS SOCIETY (VITMUN)",
        "description": "Model United Nations Society, VIT runs on the foundation of social and political awareness. MUNSoc believes in spreading this knowledge and constantly conducts awareness workshops on campus. In collaboration with giant organizations like the United Nations Information Centre for India and Bhutan, Global Citizen India and HeForShe, the club organizes one of the largest MUN in India, VITMUN that is known across the country for its quality of debate and competition. The club sends its delegation to MUNs across the country and has won numerous Best Delegation awards each academic year. The competitions require an extensive amount of knowledge of international and national affairs including fields like politics, economics, law and human rights.",
        "img_path": "VIT - MUNSOC.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "website": "https://vitmun.vit.ac.in/",
            "instagram": "https://www.instagram.com/vitmunsoc/?hl=en",
            "linkedin": "https://in.linkedin.com/company/munsocvit",
            "facebook": "https://www.facebook.com/MUNSocVIT/"
        }
    },
    {
        "serial": 23,
        "name": "ANOKHA",
        "description": "Anokha, the inception of change, is a non-profit organisation that works towards welfare of the underprivileged kids. Their basic aim is to reach out to the children of Vellore and to teach English as well as speaking and communication skills to the children in the orphanages. Baisc aim is to reach out to school and college going students and mould them to become better speakers and leaders of tomorrow. Think of the successful leaders you know. They probably have one trait in common – the ability to communicate effectively. Kids need these skills so they can grow to meet the challenges of adulthood and leadership successfully. These sessions will help young people build their communication and leadership skills so they may become tomorrow’s leaders in business, industry and the community.",
        "img_path": "ANOKHA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "website": "https://ngoanokha.github.io/",
            "instagram": "https://www.instagram.com/ngoanokha/?hl=en",
            "youtube": "https://youtube.com/@anokha8228",
            "facebook": "https://www.facebook.com/anokhavit/",
            "linkedin": "https://in.linkedin.com/company/anokha-ngo"
        }
    },
    {
        "serial": 24,
        "name": "YOUTH RED CROSS ASSOCIATION (YRC)",
        "description": "The Youth Red Cross Society (YRC) is the most important constituent of its parent organization Indian Red Cross Society. The main objectives of the YRC movement is based on the principles of protection of health and life, service to the sick and suffering, promotion of national and international friendship to develop the mental and moral capacities of youth. Objectives of Youth Red Cross: To inculcate in the Youth of our country, Awareness on the care of their own health and that of others, Understanding and acceptance of civic responsibilities and acting accordingly with humanitarian concern, to fulfil the same, To enable the growth and development of a spirit of service and sense of duty with dedication and devotion in the minds of youth, To foster better friendly relationship with all without any discrimination. YRC organizes blood donation camps and health camps periodically.",
        "img_path": "RRC.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/youth-red-cross-vit",
            "facebook": "https://www.facebook.com/YouthRedCrossVit/"
        }
    },
    {
        "serial": 25,
        "name": "GOOGLE DEVELOPERS STUDENT CLUB (GDSC)",
        "description": "Developers Student Club or Google Developer Groups (GDGs) provide to developers who are interested in Google's developer technology; everything from the Android, App Engine, and Google Chrome platforms, to product APIs like the Maps API, YouTube API and Google Calendar API. Run by passionate individuals in local developer communities, A group to share ideas and network with fellow developers, A place to learn about Google technologies and development tools, as well as what local companies and developers are doing with these technologies, Focused on developers and educational technical content, Open to and free for all interested.",
        "img_path": "DEVELOPERS STUDENT CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://www.dscvit.com/",
            "instagram": "https://www.instagram.com/gdscvitvellore/",
            "twitter": "https://twitter.com/gdscvit",
            "facebook": "https://www.facebook.com/gdscvitvellore",
            "medium": "https://medium.com/gdg-vit",
            "telegram": "https://t.me/joinchat/Zlq0k9DMj6cxYTQ9",
            "linkedin": "https://www.linkedin.com/company/dscvit/",
            "youtube": "https://www.youtube.com/channel/UCvT-ZJF7fXHJi9kDeCPR-zg",
            "github": "https://github.com/GDGVIT"
        }
    },
    {
        "serial": 26,
        "name": "CUBING CLUB",
        "description": "Cubing Club helps to create and foster a spirit of Rubiks cube solving among people of the world. To take an active interest in the puzzle solving skill and its development. To provide a forum for Rubic cube enthusists to showcase and improve their talent. To provide a platform for an underrated talent and make sure it is rcognised. To make people more competitive by making them meet new people and team new shiffs. To let people explore themselves and do something more than what they think they can do.",
        "img_path": "CUBING CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/cube_vit/",
            "youtube": "https://www.youtube.com/@cubevit",
            "linkedin": "https://www.linkedin.com/company/the-cubing-club-vit-vellore",
            "facebook": "https://www.facebook.com/c.u.b.e.VITclub/"
        }
    },
    {
        "serial": 27,
        "name": "TREKKING CLUB",
        "description": "Trekking Club has brought out the need to care for the nature and has thrown light on its aesthetic beauty. We promote hiking, trekking, camping, mountaineering and allied open air activities. Club conducts several large events on an annual basis such as marathons, triathlons, environment awareness drive and symposiums with the aim to slowly but steadily transform people’s now sedentary, unhealthy lifestyles and inspire them to take up a sport and outdoorsy activities. We conduct regular treks, runs, cycling events, swimming events and camping on a regular basis to various places from time to time.",
        "img_path": "TREKKING CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vittrekkingclub/?hl=en",
            "facebook": "https://www.facebook.com/VitTrekkingClub/",
            "linkedin": "https://in.linkedin.com/company/vit-trekking-club"
        }
    },
    {
        "serial": 28,
        "name": "DANCE CLUB",
        "description": "Dance Club promote the dance art form both regional and western and give opportunity for students to perform. Dance Club also helps the students of VIT to explore themselves in terms of their dancing talents and encourages them to participate in all on-going events by conducting routing workshops which are held by trained and professional dancers with highly prosperous backgrounds. This motivates the students to grow in terms of their dancing abilities and in turn helps them to develop their dancing skills. Members have been so victorious with regard to competitions that are held across the country and have managed to triumph in all of them. Club consists of six major teams of varied dance forms across India. They are Namely BBC, Chargers, JnJ, Maya, Mirage, Unitrix.\nACHIEVEMENTS\nPegasus 2019\nSpandan 2019",
        "img_path": "VIT DANCE CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitdanceclub/?hl=en",
            "youtube": "https://www.youtube.com/@vitdanceclub",
            "linkedin": "https://www.linkedin.com/company/vit-dance-club",
            "facebook": "https://www.facebook.com/vitdc/"
        }
    },
    {
        "serial": 29,
        "name": "CYCLING CLUB",
        "description": "VIT Cycling club promote bicycling as an aid to general fitness. Educate members in safe cycling, particularly with regard to safe equipment and bike maintenance, proper cycling habits, and rules of the road. Differnt events are organized for members and non-members cycling events such as short and long distance touring and safety clinics. Promote, support, and train potential competitive cyclists (racers) in the community and to organize safe racing events for this purpose. We also aim to make VIT a safer place for cycling and to encourage cycling for transport and recreation.",
        "img_path": "CYCLING CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS",
            "ENVIRONMENTAL_SUSTAINABILITY"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit_cycling_club/",
            "facebook": "https://www.facebook.com/vitcyclingclub/",
            "linkedin": "https://in.linkedin.com/in/cycling-club-vit-79384134a"
        }
    },
    {
        "serial": 30,
        "name": "DRAMATICS CLUB",
        "description": "Dramatics Club exists for the sole purpose of promoting and reviving the art of theatre through various events on campus. We train in promoting cultural learning of acting among students, start act, plays and to perform. Apart from stage play, street play and mono-acting, we conduct acting workshop open to all. The talented members put up plays on days of importance to spread awareness. Members also get chance in participating (and winning) in stage play and street play competitions in various other universities throughout the southern circuit.",
        "img_path": "DRAMATICS CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitdramatics/?hl=en",
            "linkedin": "https://in.linkedin.com/company/vit-dramatics-club",
            "facebook": "https://www.facebook.com/VitDramaClub/",
            "youtube": "https://www.youtube.com/@vitdramatics"
        }
    },
    {
        "serial": 31,
        "name": "CREATIVITY CLUB",
        "description": "Creativity Club provide a platform for students to display their creative side in various academic and non-academic fields. To develop an ‘out-of-box’ thinking in students essential for problem solving in a working environment as well as in daily life. The goal of the Creative Arts Club is to promote creative arts on campus through activities that bring students together. Our purpose is to give students who are not art majors a way to explore their creative side and participate in the college artistic community. To equip students with life skills and tools required to lead a happy and satisfactory life. Club organizes variety of programs like educational, social, cultural, and recreational and entertainment programs. These programs gives an opportunity for students to develop their interactions among groups, helps enhance their creative and leadership skills.",
        "img_path": "CREATIVITY CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/creativityclub_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/creativity-club-vit",
            "facebook": "https://www.facebook.com/creativityclubvit/mentions/"
        }
    },
    {
        "serial": 32,
        "name": "NATURE LOVERS CLUB",
        "description": "Nature Lover's Club, harboring the institute’s most ardent nature enthusiasts aim to spread awareness about the importance of nature and its conservation in developing a better tomorrow. The club aims at increasing awareness among the students and providing freedom to participate in various environmental activities. In the process of conserving ecology and promoting sustainable development. Protecting and sustaining the environmental conditions in and around the campus and inspiring others to do on a large scale all around the nation.",
        "img_path": "NATURE LOVERS CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH",
            "ENVIRONMENTAL_SUSTAINABILITY"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/natureclubvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/nature-club-vit"
        }
    },
    {
        "serial": 33,
        "name": "THE CATALYST CLUB",
        "description": "The Catalyst Club, a club for chemistry lovers. The club shall be to provide a better understanding of chemistry, to promote and improve education in chemistry, to acquaint individuals with current trends in chemistry, and to provide opportunity for individual participation and professional growth. Through large public demo shows and smaller interactive groups, we strive to teach individuals that chemistry is fun. Promote an interest in the field of chemistry and stimulate scientific curiosity in general; Provide assistance in the field of chemistry and encourage an atmosphere to exchange thoughts and ideas; Promote the distribution of chemical knowledge through seminars and visiting lecturers; Make available to the members details of the numerous job opportunities open in the field of chemistry; Promote the importance of chemistry and the physical sciences in everyday life.",
        "img_path": "THE CATALYST CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/thecatalystclubvit/?hl=en",
            "linkedin": "https://in.linkedin.com/in/the-catalyst-club-vit-756b9926a"
        }
    },
    {
        "serial": 34,
        "name": "ROTARACT CLUB",
        "description": "Rotaract club: Dedicated student community who share a passion for community service and friendship and focusses on to improve the lifestyle of the under privileged. Rotaract clubs bring together people ages 18-30 to exchange ideas with leaders in the community, develop leadership and professional skills, and have fun through service. In communities worldwide, Rotary and Rotaract members work side by side to take action through service. From big cities to rural villages, Rotaract is changing communities like yours. Rotaract plan and carry out activities and service projects. Rotary club sponsors offer guidance and support and work with your club as partners in service.",
        "img_path": "ROTARACT CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/rotaract_club_of_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/rotaract-at-vit"
        }
    },
    {
        "serial": 35,
        "name": "QUIZ CLUB",
        "description": "Quiz Club (V) helps to nurture quizzing as a mind sport among the university students; to foster the university quizzers to win various quizzes at national and international level; and to establish the quizzing culture at VIT at par with other world renowned universities. DBQC regularly participates and wins at some of India's largest fests; the Quiz Club is an envious mix of brilliant people. The club prides itself for its very diverse talent pool, which comprises pop culture aficionados, tech geeks, movie buffs and almost every passion under the sun. The club redefines 'Quizzing' in many ways, attracting not only seasoned quizzers, but anyone with a spark of curiosity.",
        "img_path": "QUIZ CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/quizclubvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/dbqc-the-vit-quiz-club",
            "facebook": "https://www.facebook.com/vitquizclub/"
        }
    },
    {
        "serial": 36,
        "name": "INTERNET OF THINGS COMMUNITY (IOTHINC)",
        "description": "Internet of Things Club (IoThinc): The Internet of Things has become one of the hottest topics in technology and everyone from small to large companies, universities, and now even governments has jumped on the bandwagon. Welcome to the exciting and emerging world of the Internet of Things. Club Aims To increase awareness of the opportunities presented by Internet of Things as a growing concept, To provide a social platform for Internet of Things enthusiasts (like-minded individuals) to network and connect with experts within the field. To host workshops to facilitate the building of simple Internet of Things devices, hence allowing students to interact with them in a widely accessible manner. To form teams to take part in IoT-based competitive activities (e.g. Internet of Things hackathon). To encourage students to incorporate skills learned within their respective faculties into IoT-based projects that they will strive to create.",
        "img_path": "IOTHINC.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/iothincvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/iothincvit",
            "medium": "https://medium.com/iothincvit",
            "facebook": "https://www.facebook.com/iothincVIT/"
        }
    },
    {
        "serial": 37,
        "name": "FIFTH (5TH)PILLAR",
        "description": "5th Pillar, a non-profit organization that aims to encourage, enable, and empower every citizen of India to eliminate corruption at all levels of society. The main objective of 5th Pillar is to strengthen democracy by way of preparing the next generation youth to be dutiful and patriotic citizens in all aspects- following traffic rules, adhering to better environment friendly practices, helping fellow citizens to live a bribe-free life by educating them on the procedures they learn. In order to sensitize the young generation to become socially responsible individuals, to be informed about the various laws governing their functioning as part of the society, 5th Pillar organises awareness programs. 5th Pillar has acquired a special consultative status from the United Nations’ Economic and Social Council in New York and has taken part in the UN’s Global compact program in India.",
        "img_path": "VIT FIFTH PILLAR.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/5pvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/5th-pillar",
            "website": "https://5pvit.wordpress.com/",
            "facebook": "https://www.facebook.com/5pvit/",
            "medium": "https://medium.com/@5thpillar"
        }
    },
    {
        "serial": 38,
        "name": "PUNJABI LITERARY ASSOCIATION (PLA)",
        "description": "The Punjabi Literary Association has the vision to hone the Punjabi Literary skills of students. It has a motto to revisit the old scriptures of Punjabi Literature and make people aware of how diverse Punjab's cultural heritage is. The Punjabi Literary Association takes it upon itself to enhance the Punjabi linguistic and writing skills of students’. It has a mission to build up the confidence and groom the talents of students to face an audience. It plans to conduct events in line with the culture and heritage of Punjab. The objectives are: To make people realize how vast Punjabi culture is, To inculcate among students a flair for Punjabi language and enhance their literary skills, To restore scriptures of the past and make students understand its importance, To encourage students' skills creative writing and expression, To enhance their thought and speech through group discussions and sessions, To conduct events that provide insight into Punjab's history and heritage.",
        "img_path": "PUNJABI LITERARY ASSOCIATION.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/pla_vit/?hl=en",
            "facebook": "https://www.facebook.com/people/Punjabi-Literary-Association/100068130679238/",
            "linkedin": "https://in.linkedin.com/company/pla-vit"
        }
    },
    {
        "serial": 39,
        "name": "HEALTH CLUB",
        "description": "The Health club “ensure the provision of comprehensive health and nutrition education and related support services to students to equip with basic life skills for healthy living, which will lead to improvements in student’s survival and educational outcomes. The overall goal of the health club is to promote effective learning through supporting students to increase their knowledge and understanding of health issues that affect them directly and guide them to adopt positive behaviours to prevent poor health. The specific objectives of the Club are: to promote hygienic lifestyles amongst students, to increase students’ knowledge and understanding of Water, Sanitation and Hygiene issues, to promote a healthy campus environment, to encourage outreach to the home and community, to challenge students to take up leadership roles and responsibilities. We also provide Health awareness among student’s through seminars and organising different events. Also medical check camps and career counselling in orphanages, Government schools and old age homes nearby Vellore district are organized time –to –time.",
        "img_path": "HEALTH CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/health_club_vit/?hl=en",
            "facebook": "https://www.facebook.com/healthclubvit/",
            "linkedin": "https://in.linkedin.com/company/health-club-vit"
        }
    },
    {
        "serial": 40,
        "name": "ENGLISH LITERARY ASSOCIATION (ELA)",
        "description": "English literary Association (ELA) promotes English Literature among students. Club provides a platform to students to showcase their literary skills and help other students who are interested in English Literature and History gain an insight into the same. At the English Literary Association, members are encouraged to show off their prowess in wordplay, humour and wit. We attend fests all over colleges in South India and participate in literary events which challenge our members to think outside the box and display their oratory and communication skills. We were VIT’s first festing club and continue our legacy as we win almost every fest that comes our way. We also try to play a role in our members’ personality development over time and help them become more confident.",
        "img_path": "ELA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "discord": "https://discord.com/invite/2VymrSvyWH",
            "instagram": "https://www.instagram.com/elaavit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/elavit",
            "medium": "https://elaavit.medium.com/"
        }
    },
    {
        "serial": 41,
        "name": "INNOVATION AND CREATION CLUB",
        "description": "The Creation lab is a club for hacker/maker space to aid & stimulate students to reflect creatively and innovate. Sighted at implementing the resources and abilities to those who think outside the box. This joint effort to create, innovate and cooperate between various disciplines provides the translation of simple ideas into inventions in science & technology. We believe that user-centric products which achieve excellence because we build their products and services around the needs of our customers. We create state-of-the-art user experiences by getting our users’ input in creating an ideal journey that combines useful functionality with high design and development standards.",
        "img_path": "ICI.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/innovation-and-creation-club-vit",
            "instagram": "https://www.instagram.com/iacc_vit/"
        }
    },
    {
        "serial": 42,
        "name": "FINE ARTS CLUB (TFAC)",
        "description": "The Fine Arts Club (TFAC) is the arts club where students can discover, nurture and promote artistic talent at VIT. We provides an opportunity to the students to let their imagination run wild and provides them with the sight to see things in a different way in the area of drawing and painting, crafts, displays etc. Students learn from one another and share their prowess in different aspects of art. We conduct art events, art exhibition, art workshops to inspire young artists and display their talent. We handle the campus decoration make numerous large scale artworks and creative installations. We also participate in external college fests at their art competitions and win numerous prizes. TFAC is responsible for promoting art in campus and making it colourful",
        "img_path": "FINE ARTS CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/thefineartsclubvit/?hl=en",
            "facebook": "https://www.facebook.com/thefineartsclubvit/",
            "website": "https://thefineartsclubvit.netlify.app/"
        }
    },
    {
        "serial": 43,
        "name": "THE NEXT CHAPTER - BOOK CLUB",
        "description": "Book Club (The Next Chapter) helps to inculcate the art of reading in the students of VIT. To provide people a platform where they can speak about their favourite books and simultaneously spread their knowledge with others. It will make people aware of the different kinds of genres of books available like self-help, current affairs, books on higher education which students tend to ignore usually. It will provide a sense of community amongst people who love to read but are not interested or good at writting. To help people deal with stress by reading more books. This will not only help them deal with stren art will also deepen their knowledge.",
        "img_path": "BOOK CLUB (THE NEXT CHAPTER).webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/thenextchapter.vit/?hl=en",
            "medium": "https://medium.com/@bookclub_86365",
            "linkedin": "https://in.linkedin.com/company/the-next-chapter-vit"
        }
    },
    {
        "serial": 44,
        "name": "DREAM MERCHANTS",
        "description": "Dream Merchants aims to provide a stimulus to the sharing of knowledge by organizing interactive discussions, seminars, mock forums, employment generation among the underprivileged, seminars, mock forums, employment generation among the underprivileged, etc. We aim to provide a range of ways to get the student community involved in events like Talk show on industry insiders’s insights, preparing Industry-ready acumen and skills, etc for career advancement besides the regular events like Financial Forum, Mutual Fund Meeting and Budget Mock in which attendees will not only learn more about the workings of the stock markets, but also have the chance to trade on an individual or group basis in order to contribute to understanding finance and daily lives.",
        "img_path": "DREAM MERCHANTS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/dreammerchantsvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/dream-merchants-vit",
            "facebook": "https://www.facebook.com/DreamMerchantsVIT/"
        }
    },
    {
        "serial": 45,
        "name": "TAMIL LITERARY ASSOCIATION (TLA)",
        "description": "The Tamil Literary Association (TLA) strives to hone the all round talents of an individual who wishes to master the language - TAMIL. It facilitates a variety of events that engage you as an audience and a participant. TLA possesses the seriousness associated to promote TAMIL Literature. To provide a platform for students to showcase their tamil literary skills. To help other students who are interested in tamil literature and history gain an insight into the same with fun, energy and enthusiasm. The TLA hosts events like kalakkal kacheri , aadalam va chinnada dance and a lot more events which serve as great platforms for the students of VIT to exhibit their talents.",
        "img_path": "TLA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitu.tla/?hl=en",
            "linkedin": "https://in.linkedin.com/company/tamil-literary-association-tla",
            "facebook": "https://www.facebook.com/vitu.tla/#"
        }
    },
    {
        "serial": 46,
        "name": "SOLAI",
        "description": "Solai Club – Sustainable Organic Living with Agricultural Initiatives) at VIT is to realize Vellore district as an exemplary model for implementation of sustainable agricultural at farm and home. Various events are planned and organised for dissimilation of knowledge for students. Field visits, data documentation hands on training for Kitchen gardening, food waste composting, minimizing food storage losses, cultivation of household medicinal plants etc. Creating awareness on commercial agriculture and broadcasting on opportunities related to skilled training. Competitive programmes on the application of core engineering principles to solve agriculture problems are also organised.",
        "img_path": "SOLAI CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL",
            "ENVIRONMENTAL_SUSTAINABILITY"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/solaiclubvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/solaiclubvit",
            "medium": "https://medium.com/solai-club-vit",
            "facebook": "https://www.facebook.com/solaiclubvit/",
            "website": "https://solaiclub-vit.blogspot.com/"
        }
    },
    {
        "serial": 47,
        "name": "ADVANCED DEVELOPERS GROUP (ADG)",
        "description": "Apple Developers Group (ADG) is a technical chapter established under Apple University Program. Helps to understand the latest technologies required to develop IOS applications. Provide and Apple development environment for the IOS developers. ADG encourages as well as assists budding developers to become the better version of them. We excel in the fields of iOS app development and Web app development. Various workshops and technical events are organized for the students where they are mentored to build up their skill set. Hack-a-thon are also organized to bring forth supercalifragilisticexpialidocious solutions for a range of real-world problems.",
        "img_path": "ADI.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "facebook": "https://www.facebook.com/vitios",
            "twitter": "https://twitter.com/adgvit",
            "instagram": "https://www.instagram.com/adgvit/",
            "website": "https://adg-vit.github.io/"
        }
    },
    {
        "serial": 48,
        "name": "MOZILLA FIREFOX",
        "description": "Mozilla Club to help students shape their experience of the internet and other such application to provide a platform for the development of free and open source software and tools using Mozilla products. Programs that incite invention, inspire innovation, and foster global change using Mozilla products. Mozilla program engages students all over the world, building campus groups that contributing to Mozilla as advocates, technologists, and innovators. Clubs helps to spark a movement -- a loud voice, a breeding ground for new ideas, a massive force, a deep talent pool -- that powers the open web to new heights. Campus Clubs plan the impact they want to have for the open web and then hack and build on a combination of recommended activities and their own open source projects to make a difference for the web, their campuses and communities.",
        "img_path": "MOZILLA FIREFOX.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://www.mfcvit.in/",
            "instagram": "https://www.instagram.com/mfc_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/mfcvit",
            "github": "https://github.com/MFC-VIT"
        }
    },
    {
        "serial": 49,
        "name": "NUTRITION CLUB",
        "description": "Nutrition Club provide hospitality and nutrition information and promote sound nutrition practices among the students. Provide opportunities for members to participate in volunteer activities and become familiar with the academy of nutrition. Increasing awareness of students in VIT and a larger society about the imporatnce of nutrition and healthy diet. Increasing nutritional knowledge among our fellow students. To reinforce specific nutrition related practices or behaviours to change habits that contribute to poor health. To provide people with correct information on the nutritional value of foods, food quality and safety. Create awareness about health impact of junk foods. To create awareness about what food to eat and what food not to eat. To provide information of nutrition food to take before and after any sports competitions. Help students to reduce or gain weight by suggesting them proper diet. Provide information about food energy sources (fats, proteins, carbohydrates and alcohol). Provide information on the amount of calories that can be taken in a day.",
        "img_path": "NUTRITION CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/nutrition_club.vit/",
            "linkedin": "https://in.linkedin.com/in/nutrition-club-of-vit-b49040226",
            "facebook": "https://www.facebook.com/profile.php?id=100064089038245&locale=de_DE#"
        }
    },
    {
        "serial": 50,
        "name": "GURUTVA - THE PHYSICS CLUB",
        "description": "Gurutva- The Physics Club focus on for a common room for the young science enthusiasts to popularise physics among all categories of people. Also link between pat, present and future members of club to ensure assured opportunities by enhancing to engage, explore and travel along with coherent people in the path of physics. To increase the exposure of students and get them connected with differnt labs across the world. Train students in various computational sofware and technologies.",
        "img_path": "GURUTVA - THE PHYSICS CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/gurutva_vit/"
        }
    },
    {
        "serial": 51,
        "name": "JUVENILE CARE",
        "description": "Juvenile Care VIT is a charitable trust that works for the welfare of underprivileged kids and provide complete child education. It helps college students, to utilise their time to work for orphanage workshops, Microsoft Office workshops in schools and orphanages, medical camps in slums and villages and teacher training programmes. The mission of the organisation is to give a platform to the youth to come forward and work for an alleviation of society. Project EHSAAS is an initiative working towards eradicating child labour and poverty. Project KAGAZ helps recycles paper by binding it to make registers for schoolchildren. Project UNIED is a teaching workshop that implements new teaching methodologies for primary school teachers. They also have a handful of other projects like Sparsh, Vidhya, Muskaan Save the Girl Child.",
        "img_path": "JUVENILE CARE.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/juvenile-care-vit",
            "medium": "https://medium.com/juvenile-care-vit",
            "instagram": "https://www.instagram.com/juvenilecarevit/?hl=en",
            "facebook": "https://www.facebook.com/juvenilecarevit/"
        }
    },
    {
        "serial": 52,
        "name": "BENGALI LITERARY ASSOCIATION (AIKYATAAN)",
        "description": "The Bengali Literary Association (BLA) strives to hone the all-round talents of an individual who wishes to master the Bengali language. It facilitates a variety of events that engage you as an audience and a participant. BLA possesses the seriousness associated to promote Bengali Literature. To provide a platform for students to showcase their bengali literary skills. To help other students who are interested in bengali literature and history gain an insight into the same with fun, energy and enthusiasm. BLA hosts events like to promote Bengali literature and a lot more events which serve as great platforms for the students of VIT to exhibit their talents.",
        "img_path": "AIKYATAAN.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/aikyataan_vit/?hl=en",
            "medium": "https://medium.com/aikyataan",
            "linkedin": "https://in.linkedin.com/company/aikyataan-bengali-literary-association",
            "facebook": "https://www.facebook.com/aikyataan.vitu/",
            "youtube": "https://youtube.com/@bengaliliteraryassociation4659"
        }
    },
    {
        "serial": 53,
        "name": "HINDI LITERARY ASSOCIATION (HLA)",
        "description": "Hindi Literary Association (HLA) working tirelessly towards the growth, progress and promotion of Hindi Language, the mother tongue of the majority of Indian population. Club promote Hindi Literature and provide a platform to Hindi speaking students to showcase their literary skills. To help other students who are interested in Hindi Literature and History gain an insight into the same. We conduct various events with Hindi being the medium that prove to be an epitome of creativity. There's hardly any area where we haven't left a mark. When it comes to social awareness, we embrace it with full responsibility.",
        "img_path": "HLA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "website": "https://hlavitu.github.io/",
            "instagram": "https://www.instagram.com/hla_vitu/?hl=en",
            "linkedin": "https://www.linkedin.com/company/hindi-literary-association",
            "facebook": "https://www.facebook.com/hla.vitu/"
        }
    },
    {
        "serial": 54,
        "name": "MUSIC CLUB",
        "description": "Music Club helps to bring out the musical talents (both vocal and instrumental) and providing them a stage to perform. The club has been teaching music theory in addition to the practical aspects of music. The club support members having multitudes of talent in different spheres. Be it guitarists, keyboardists, bassists, drummers, violinists or vocalists, the club has a very diverse talent in terms of the variety of instrumentalists and a range of different vocalists certainly not bound genres. The Music Club is known for hosting its Flagship event called ‘Monday Music’ where multiple acts (Solo/Duet/Bands) perform on the coveted Greenos stage to an ever increasing crowd. The music club handles sound for various events and even provides the necessary support for their conduction. All in all it is a family of some excellent musicians and wonderful people.",
        "img_path": "MUSIC CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitmusicclub/?hl=en",
            "linkedin": "https://in.linkedin.com/company/vit-music-club",
            "youtube": "https://www.youtube.com/@MUSICCLUBVIT",
            "facebook": "https://www.facebook.com/musicclubvit/"
        }
    },
    {
        "serial": 55,
        "name": "RED RIBBON CLUB",
        "description": "Red Ribbon clubs (RRC) are envisaged to instill among all the students the values of service, develop healthy life styles, and increase access to safe and adequate quantities of blood to all the needy by promotion of regular voluntary blood donation. RRC aims at harnessing the potential of the youth by equipping them with correct information on Mental Health, Substance abuse, Nutrition and reproductive & Sexual health and building their capacities as peer educators in spreading messages on positive health behavior in an enabling environment. OBJECTIVES: To reduce new occurrences of HIV infection among youth by raising their risk perception through awareness on HIV prevention methods, To induce the spirit among youth to help and support people living with HIV/AIDS (PLWHA) thereby reducing stigma and discrimination against PLHWAs, To motivate youth and build their capacity as peer educators and change agents by developing their skills on leadership, negotiation, and team building, To promote voluntary blood donation among youth.",
        "img_path": "RRC.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/red-ribbon-club-vit-vellore"
        }
    },
    {
        "serial": 56,
        "name": "BULLS AND BEARS CLUB",
        "description": "Bulls and Bears: The Finance Club, VIT, promotes finance related activities and careers throughout the VIT students. The main objective of this club is to spread awareness in the domain of finance, in particular investment banking, stocks and trading, private wealth management and many more. The club provides a constructive platform for helping the finance aspirants apply theoretical concepts they have learnt in real life. The club has an objective of providing a constructive platform for helping the budding finance warilocks grow and apply the theoretical concepts they have learnt in real life.",
        "img_path": "BULLS AND BEARS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/bullsandbears_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/bnbvit",
            "twitter": "https://x.com/bnbvit",
            "facebook": "https://www.facebook.com/bnbvit/"
        }
    },
    {
        "serial": 57,
        "name": "ROBOVITICS",
        "description": "RoboVITics, the robotics club of VIT, provides a base for robotics enthusiasts to progress and contribute to the field of robotics. We provide efficiency in the field of robotics, control and automation; and to expand the scope beyond VIT. Helps to facilitate students to understand, design and learn robotics. Provide interested students with opportunities to express their skills, knowledge and creativity through conceptualizing, designing and programming robots. To support and foster interest in various aspects related to robotics. We act as a stepping stone for young engineers to strive and excel in robotics and automation in the future.",
        "img_path": "ROBOVITICS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://robovitics.in/",
            "instagram": "https://www.instagram.com/robovitics/?hl=en",
            "linkedin": "https://in.linkedin.com/company/robovitics",
            "facebook": "https://www.facebook.com/robovitics/"
        }
    },
    {
        "serial": 58,
        "name": "BECOMING I FOUNDATION",
        "description": "Becoming I Foundation is an internationally recognized youth led organization that mobilizes young people into engaging with community development issues. Through projects in the fields of women empowerment, trafficking, primary education, alternate sources of employment, leadership training, life skills development and youth empowerment. We derive our energy from our corpus of dedicated volunteers who have an equal say in the design and implementation of every project. It is our core belief that a democratic structure is necessary to inculcate a sense of ownership and automatic commitment and dedication towards the project. We at Becoming I believe in stable, sustainable change. We love what we do and with each project, campaign and event that we have been a part of, we have grown and reshaped our goals.",
        "img_path": "B I F.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/bif_vit/?hl=en",
            "medium": "https://medium.com/becoming-i-foundation",
            "facebook": "https://www.facebook.com/onestopvit/",
            "linkedin": "https://in.linkedin.com/company/becoming-i-foundation-vellore-chapter"
        }
    },
    {
        "serial": 59,
        "name": "KANNADA LITERARY ASSOCIATION (KANNADA KASTHURI)",
        "description": "Kannada Literary Association (Kannada Kasthuri - KLA) promotes Kannada Literature and provides a platform to Kannada students to showcase their literary skills. Club help other students who are interested in Kannada Literature and History gain an insight into the same. Our Club’s basic motive is to give the students of Karnataka a literary insight also to preserve the historical heritage the state. Literary competitions are held which include poetry, script writing, story writing, etc. to promote Kannada language.",
        "img_path": "KLA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/kla.vit/?hl=en",
            "facebook": "https://www.facebook.com/vitu.kla/",
            "linkedin": "https://in.linkedin.com/company/kannada-literary-association"
        }
    },
    {
        "serial": 60,
        "name": "ARCHI-TECH",
        "description": "Archi-Tech Club: The goal of the Architectural Club is to establish and maintain a community of peers with a common interest in architecture and design. We wish to make the fields of architecture and design accessible. Additionally, we would like to generate interest for the fields of architecture and design. To facilitate the knowledge sharing and skill development activities through seminars and hands on workshops in the Architecture related areas like digital architecture, visual merchandising, model making, spatial ideation exercises, and graphical manifestation creations – execution works. With a mission to travel to see new buildings in the area, go on construction tours, visit architectural offices, watch films about architects/architecture, participate in design competitions, invite speakers to the College for presentations about sustainable design/building codes/lighting, and visit local schools of architecture.",
        "img_path": "ARCHI-TECH.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/arch.i.tech/?hl=en",
            "linkedin": "https://in.linkedin.com/in/archi-tech-club-a4b854230",
            "twitter": "https://x.com/ArchitechCLUB1"
        }
    },
    {
        "serial": 61,
        "name": "UDDESHYA",
        "description": "Uddeshya is a social outreach organisation bound by its motto in \"Empowering Youth - Fueling Change\", is the motto the members of Uddeshya abide by on their journey to achieve long lasting change. Uddeshya strives to motivate the youth to take up the mantle of change by empowering them and engaging them to tackle and address multifaceted subjects including Public Policy, Civic Rights and Duties, Sustainable Development, Education, HIV/AIDS, Substance Abuse Awareness, Electoral Integrity, Peer Pressure, Bullying, Child Abuse, et cetera. With the help of volunteers spread across various chapters, Uddeshya actively works for and with the youth, aiming to provide a platform for potential change-makers to implement their ideas and work as community leaders to address various issues. Having pioneered conferences including Impact and Parliament Direct, Uddeshya reaches out to thousands of youngsters every year.",
        "img_path": "UDDESHYA.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/uddeshyavit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/uddeshyavit",
            "facebook": "https://www.facebook.com/VIT.Uddeshya/"
        }
    },
    {
        "serial": 62,
        "name": "ASTRONOMY CLUB- VIT STELLAR",
        "description": "To enhance the knowledge of students interested in astronomy and expose students to the wonders of space and astrophysics. To facilitate the creation of a community of space enthusiasts. We believe that this initiative of having a full-fledged astronomy chapter at our university will popularize astronomy among students. Such a club will expand the base of existing opportunities and open up more avenues for exploration and career-making for students through intellectual and professional development. Ability to demonstrate the understanding behind the theories of cosmic evolution, the science of astronomy, and the position of humanity in the universe. Ability to apply scientific reasoning to advanced astronomical discoveries and understand their validity and apply them in everyday situations. Read, analyze, and interpret data to draw valid scientific conclusions and communicate those conclusions in a clear and articulate manner. To achieve a enhance the skills of students which will help them in increasing their job prospects and will provide them with more than one career opportunities to choose from.",
        "img_path": "ASTRONOMY CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit_stellar/?hl=en",
            "facebook": "https://www.facebook.com/vitstellar/",
            "linkedin": "https://in.linkedin.com/company/vit-stellar"
        }
    },
    {
        "serial": 63,
        "name": "ENVIRONMENT & ENERGY PROTECTION CLUB (E2 PC)",
        "description": "‘Energy & Environment Protection Club (E2PC) is the official eco club of VIT. We aim to work at a ground level, to protect and conserve \"the third rock\" from the sun, by persuading individuals to take up responsibility on matters pertaining to sustenance on the \"Blue Planet\". As the standard of life is increasing, using energy has become a prerogative for every individual. Energy, which comes with so much of conversions and processes and environmental compromises, is a precious commodity which has to be judiciously, effectively and carefully used to save the environment. We also aim at making the world clean and green.",
        "img_path": "E2PC.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "facebook": "https://www.facebook.com/e2pcvit/",
            "instagram": "https://www.instagram.com/e2pc.vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/energy-and-environment-club-vit"
        }
    },
    {
        "serial": 64,
        "name": "FRENCH LITERARY ASSOCIATION (FLA)",
        "description": "French literary Association (FLA) promotes French Literature among students. Club provides a platform to students to showcase their literary skills and help other students who are interested in French Literature and History gain an insight into the same. French Club aims to engage students in events related to the French language and the cultures of Francophone (French-speaking) countries in order to broaden their international knowledge and understanding. Develop various forms of purposeful engagement within various French and Francophone communities and cultures.",
        "img_path": "FRENCH LITERARY ASSOCIATION.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit.fla/",
            "linkedin": "https://www.linkedin.com/company/french-literary-association-vit-vellore"
        }
    },
    {
        "serial": 65,
        "name": "CENTRE FOR SOCIAL ENTREPRENEURSHIP DEVELOPMENT(CSED)",
        "description": "Centre for Social Entrepreneurship Development (CSED) is an organisation where ideas come into fruition. We strive to equip young entrepreneurs with an ecosystem to start and sustain their own business. In order to do that, we host various events and conduct workshops which help students ideate at an early stage. An important part of our work is to connect entrepreneurs to investors and interns through our growing network. The sole purpose of our organisation is to provide a blank slate to anyone with an idea and help them turn into reality by providing an appropriate environment for successful growth. We train members in business development, social purchasing , social impact, social enterprise growth, business, coaching, acceleration, cluster development and social entrepreneurship.",
        "img_path": "CSED.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL",
            "ENVIRONMENTAL_SUSTAINABILITY"
        ],
        "socials": {
            "website": "https://csedvit.com/",
            "linkedin": "https://in.linkedin.com/company/csedvit",
            "instagram": "https://www.instagram.com/csed.vit/?hl=en",
            "facebook": "https://www.facebook.com/vit.csed/"
        }
    },
    {
        "serial": 66,
        "name": "MATRIX- THE MULTIMEDIA CLUB",
        "description": "The objective of The multimedia club is to spread insights about multimedia among the students and promote knowledge & understanding of Multimedia tools & their wide usage. To develop skills to encourage the production of creative digital media content. To guide students to develop an understanding of the effects of digital media on themselves as individuals and also upon society as a whole. To improve creativity and to provide a platform to creative content creators. To enhance and endorse the talents and work in the multimedia domain. To launch more visual and audio content creatively created by students. To create a healthy working environment for the people who work here. Our primary focus is to acquire the understanding of digital and multimedia and upskill the students in the same direction. and give a sense of power this can have in things they will be creating in the future. Our Motto: \" Tune it, Play it, Create it...\"",
        "img_path": "MULTIMEDIA CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/matrix.vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/matrixvit"
        }
    },
    {
        "serial": 67,
        "name": "BOARD GAMER'S CLUB",
        "description": "Board Gamers Club promote board games on campus. Get regular practice sessions functional to give the members a edge in performance. Provide training to beginners. Give everyone to tournament experience. Get more high quality players for VIT chess team. Provide a platform for people to showcase their board gaming talents.",
        "img_path": "BOARD GAMERS CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/boardgamersclubvit/",
            "linkedin": "https://in.linkedin.com/company/boardgamersclubvit",
            "facebook": "https://www.facebook.com/p/Board-Gamers-Club-VIT-100064045115317/"
        }
    },
    {
        "serial": 68,
        "name": "THE AI & ML CLUB - TAM",
        "description": "The main vision of this club is continually promoting both technical and managerial excellence for each individual and everlasting knowledge in the field of AI in a caring, respectful and supportive environment. We believe in creating a community with likeminded people to improve and strive for getting better than each day. Encouraging students to contribute and involve in this field with interesting projects which can also be converted into commercial projects as well. Also embracing entrepreneurship by establishing new start-ups. Contribution to the VIT community will always be the primary priority while taking up any task. Solving the problems with the help of AI not only inside of VIT but also to the rest of the world. Our mission is to make Artificial Intelligence is more approachable for students to learn and develop, and more accessible for the consumers to inculcate in their daily lives. We plan to focus and pivot the technical enthusiasm more towards ML and AI, thereby enabling more students to successfully deploy projects that solve issues in the real world.",
        "img_path": "THE AI & ML CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/tam.vit_vellore/?hl=en",
            "linkedin": "https://in.linkedin.com/company/tam-vit"
        }
    },
    {
        "serial": 69,
        "name": "HERITAGE CLUB",
        "description": "Heritage Club is about discovering the culture and heritage of our country as well as other heritage sites around the world. Heritage Club is also an attempt to understand all aspects that makes the identity of our Indian civilization or any other civilization in the world. The main focus of the club is on places of importance of cultural or natural heritage as described in the UNESCO World Heritage Convention; discussions, presentations and activities on world heritage sites in India; importance of monuments, buildings, churches, mosques, tombs etc. and their ‘Conservation’; research on International Heritage Sites and its relevance and awareness programmes in school on how to protect and preserve our monuments and our Heritage Sites. Along with the discussion on these points, the students are encouraged to visit heritage sites so that they can feel close and proud of their own country and its history.",
        "img_path": "HERITAGE CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/heritageclubvit/",
            "facebook": "https://www.facebook.com/heritageclubvit/",
            "linkedin": "https://in.linkedin.com/company/heritage-club-vit"
        }
    },
    {
        "serial": 70,
        "name": "CULINARY CLUB",
        "description": "Culinary Club: The purpose of our Culinary Club is to help spread knowledge about food through teaching and exploring the different aspects of the Culinary Arts. Our goal is to inspire others to pursue their Culinary Dreams. Cooking can affect people in profound ways. A spirit of collaboration and sharing is essential to true progress in developing this potential. Here we provide an opportunity to learn healthy cooking with friends. The club aims at promoting the need for a healthy life style which also involves discovering new flavours and exploring the world of culinary. Culinary club organises various major and minor college level events, competitions and workshops by professionals for students.",
        "img_path": "CULINARY CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/culinaryclubvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/culinaryclubvit",
            "facebook": "https://www.facebook.com/culinaryclubvit/"
        }
    },
    {
        "serial": 71,
        "name": "FITNESS AND BEYOND",
        "description": "\"Fitness n Beyond in VIT aimed to tackle all the problems related to fitness among Students. Physical fitness is a state of health and well-being and, more specifically, the ability to perform aspects of sports, occupations and daily activities. Physical fitness is generally achieved through proper nutrition, moderate-vigorous physical exercise, and sufficient rest. Here in our club FnB we not only cover the physical aspect but also mental and emotional aspect of fitness. We have counsellors, yoga masters, body builders, athletes, sports persons etc i.e. people from every area of fitness. Everyone craves for a good physique. But attaining it is not a simple task-it’s a combination of proper diet, adequate exercise, proper guidance, planning and time management.",
        "img_path": "FITNESS N BEYOND.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/fnbvit/",
            "linkedin": "https://in.linkedin.com/company/fitness-and-beyond-vit"
        }
    },
    {
        "serial": 72,
        "name": "LINUX USER'S GROUP (LUG)",
        "description": "Linux User's Group helps to understand the benefits of open source software over proprietary software. To create awareness and train users to go for open source software. To accelerate development and deployment of free and open source technologies, and beyond. Free to use, free to study, free to distribute, free to modify, free to access. Familarize Students with Linux Distributions, Create awarness about FOSS, Learn general softwares on Linux such as GIMP, Libre Office, To present Linux as an efficient tool in Cyber security, Get students to contribute to FOSS, Make students more industry ready and to promote Linux in General.",
        "img_path": "LINUX USER'S GROUP.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit_lug/",
            "linkedin": "https://in.linkedin.com/company/vit-lug",
            "github": "https://github.com/vitlug",
            "website": "https://lugvitc.net/"
        }
    },
    {
        "serial": 73,
        "name": "ENTREPRENEURSHIP CELL (E-CELL)",
        "description": "E-Cell helps fostering entrepreneurial spirit among the students and to provide them a platform for converting their ideas into businesses. E-Cell’s purpose is to create a culture of entrepreneurship among the students. The prime objective of the E-Cell will to help the students to develop business ideas who are eager to become entrepreneurs but are unsure about the way forward. E-Cell will help both budding and would-be entrepreneurs with refining ideas and providing practical guidance. E-Cell wanted to undertake research activities, training entrepreneurs, identifying opportunities and pursuing them. E-Cell also help the students to: Understand the role and importance of entrepreneurs in the modern economy, Identify the traits of successful entrepreneurs, Think about whether they might want to be an entrepreneur, Evaluate the trade-off between risk and reward for entrepreneurs and Learn the ways entrepreneurs fund their businesses.",
        "img_path": "E-CELL.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ecellvitvellore",
            "instagram": "https://www.instagram.com/ecell_vit/?hl=en",
            "website": "https://e-cell-vit-22.vercel.app/"
        }
    },
    {
        "serial": 74,
        "name": "CODECHEF - VIT",
        "description": "CodeChef was created as a platform to help programmers make it big in the world of algorithms, computer programming and programming contests. At CodeChef we work hard to revive the geek in you by hosting a programming contest at the start of the month and another smaller programming challenge in the middle of the month. We also aim to have training sessions and discussions related to algorithms, binary search, technicalities like array size and the likes. Apart from providing a platform for programming competitions, CodeChef also has various algorithm tutorials and forum discussions to help those who are new to the world of computer programming. Chapter provide a platform for practice, competition and improvement for both students and professional software developers. Apart from this, it aims to reach out to students while they are young and inculcate a culture of programming in India.",
        "img_path": "CODECHEF.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://www.codechefvit.com/",
            "instagram": "https://www.instagram.com/codechefvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/codechefvit",
            "facebook": "https://www.facebook.com/codechefvit/"
        }
    },
    {
        "serial": 75,
        "name": "GERMAN LITERARY ASSOCIATION (DLA)",
        "description": "German literary Association (DLA) promotes German Literature among students. Club provides a platform to students to showcase their literary skills and help other students who are interested in German Literature and History gain an insight into the same.Club aims to engage students in events related to the Gernam language and the cultures of countries in order to broaden their international knowledge and understanding. Develop various forms of purposeful engagement within various German communities and cultures.",
        "img_path": "GERMANY LITERARY ASSOCIATION.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/dla_vit/",
            "linkedin": "https://in.linkedin.com/company/german-literary-association-dla-vit",
            "facebook": "https://www.facebook.com/dlavit"
        }
    },
    {
        "serial": 76,
        "name": "OTAKU - THE ANIME FAN CLUB",
        "description": "The objectives of the Otaku club is to give chance to the fandom theories of our fans regarding movies, series, animes, etc and help them explore their creativity and help them publish their work via our account and magazines. To promote and encourage the knowledge pertaining to literature behind popular fandoms and providing the space to discuss and analyze them. The club’s purpose is to promote the culture of gaming into a more socially acceptable form of recreation and entertainment and to explore, play and discuss interactive media such as video games, role-playing games, and board games. The club will also guide a student who wants to go into the field of gaming and want to expand their career in the gaming world but due to little knowledge and lack of time to plan for their gaming career they cannot.",
        "img_path": "THE OTAKU CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/theotakuclub_vit/?hl=en",
            "linkedin": "https://www.linkedin.com/company/theotakuclubvitv/",
            "facebook": "https://www.facebook.com/theotakuclubvit/"
        }
    },
    {
        "serial": 77,
        "name": "ANCHORING CLUB",
        "description": "Anchoring on a stage is not an easy task, It is not a cakewalk to address a large crowd, making a connect with them and at the same time wearing multiple other hats and performing other duties too. How to do anchoring on stage is a question which is often asked by people who have never done it. The Anchoring group trains its members the best way to become an interesting anchor. Sessions are organised for how to engaging your audience, identify your audience, use relevant examples and dialogues to which your audience can relate to and understand easily. The use of a backup plan and helps to practice until you become perfect.",
        "img_path": "ANCHORING GROUP.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit.anchoringclub/?hl=en",
            "linkedin": "https://in.linkedin.com/company/vit-anchoring-club",
            "facebook": "https://www.facebook.com/anchoring2020/"
        }
    },
    {
        "serial": 78,
        "name": "HEARTS- UHET",
        "description": "HEARTS (Higher Education for All to Realize Transformation of Students) A club under UHET- Universal Higher Education trust, the purpose of higher education: To create prepared minds. The focus of higher education should be on creating prepared minds in their graduates, and government-sponsored research and development in higher education institutions is a great way to enrich the education of future engineers. To create awareness on the importance of higher education at a various level. To increase Gross Enrolment Ratio (GER) by assisting all eligible higher secondary students in access to higher education. Events are organised yo promote higher education for the underprivileged and marginalized communities.",
        "img_path": "HEARTS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "facebook": "https://www.facebook.com/heartsvit/",
            "linkedin": "https://in.linkedin.com/company/hearts-club-vit"
        }
    },
    {
        "serial": 79,
        "name": "VIT SPARTANS",
        "description": "VIT Spartans is a group of enthusiasts who like to encourage people to bring out their hidden talents and gave them a platform to showcase it. Club is all about providing opportunity to those people who lacks public appearance but instil huge talent. Organize workshop on Effective Public Speaking and Presentation Skills. Provide participants with the practical skills and knowledge necessary to express themselves clearly, with confidence and power, in a variety of speaking situations. Encourage the budding talents of the students and develop their creative skills. Provide the right platform to showcase their talents in various fields of art and management.",
        "img_path": "VIT SPARTANS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vitspartans/?hl=en",
            "linkedin": "https://in.linkedin.com/company/vit-spartans",
            "facebook": "https://www.facebook.com/vitspartans/"
        }
    },
    {
        "serial": 80,
        "name": "MARATHI LITERARY ASSOCIATION - (YUVA MARATHI)",
        "description": "Yuva Marathi promotes Marathi Literature and provides a platform to Marathi students to showcase their literary skills. It is a platform to bring out the literary talent among Marathi students of VIT. Club provides opportunities to students to explore their interests in various fields of Marathi literature. Conducts events throughout the academic year to bring out the flairs in students and give them stage confidence. Literary competitions are held which include poetry, script writing, story writing, etc. to promote Marathi language. To help other students who are interested in Marathi literature and history gain an insight into the same.",
        "img_path": "YUVA MARATHI.webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "website": "https://yuvamarathivit.in/",
            "linkedin": "https://in.linkedin.com/company/yuva-marathi",
            "instagram": "https://www.instagram.com/yuva.marathi/",
            "facebook": "https://www.facebook.com/YuvaMarathiYM/"
        }
    },
    {
        "serial": 81,
        "name": "VRIKSH",
        "description": "Vriksh is the initiative taken by the student community of VIT to create awareness among people regarding the importance of trees and highlight the advantages of a green society. To create a powerful impact on an ignorant community our immediate vision is to build a strong base of students who can come up with innovative strategies to promote the growth and plantation of trees. With such a large population of students, we can easily spread awareness regarding environmental health and form partnerships with local communities to sustainably conserve our surroundings. To create a powerful impact on an ignorant community our immediate vision is to build a strong base of students who can come up with innovative strategies to promote the growth and plantation of trees.",
        "img_path": "VRIKSH.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH",
            "ENVIRONMENTAL_SUSTAINABILITY"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vriksh.club/?hl=en",
            "linkedin": "https://www.linkedin.com/company/vriksh-ngo"
        }
    },
    {
        "serial": 82,
        "name": "VIT AMATEUR RADIO CLUB (VARC)",
        "description": "VARC is VIT’s official HAM Radio Club. This club caters to ham radio enthusiasts who have a deep passion for signals, frequencies, and find joy in communicating using a variety of innovative radio equipment and technology. Contrary to scheduling radio broadcasts and hosting shows, VARC helps students get a better understanding about technical aspects of radio communications. Think of it as a digital hangout for tech-savvy adventurers. VARC hosts workshops and hands-on sessions, designed to give real-world skills and foster an understanding about the complexities of radio technology. The club also invites renowned HAMS to engage with members and share insights about the continually expanding domain of amateur radio. VARC hosts regular sessions on history and basics designed to transform \"amateurs\" to Masters of the Airwaves.",
        "img_path": "VIT Amateur Radio Club (VARC).webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://vitarc.github.io/main.html",
            "instagram": "https://www.instagram.com/varc_vit/",
            "linkedin": "https://in.linkedin.com/company/varc-vit"
        }
    },
    {
        "serial": 83,
        "name": "ADVERTISING AND MARKETING CLUB",
        "description": "The Advertising & Marketing Club aims to develop a corporate relationship rooted in the discipline of \"Advertising & Marketing\" that is mutually beneficial to both students and the corporate world. This club bridges the gap between classroom teaching and practical application in various field of entrepreneurship, marketing & Startup Management. Here, college students from various streams come together under one umbrella seeking to expand their insight on the most proficient method to showcase the abilities related to their respective stream in a beneficial way and become efficient in Marketing. Thus, we are managing these aptitudes to a way where they can be utilized to the fullest. We envision to continue developing, sharing thoughts, and pioneering into this continuously evolving world.",
        "img_path": "ADMARK.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/admark.vit/",
            "linkedin": "https://in.linkedin.com/company/theadvertisingandmarketingclub"
        }
    },
    {
        "serial": 84,
        "name": "SPIC MACAY",
        "description": "The Society for the Promotion of Indian Classical Music And Culture Amongst Youth (SPIC MACAY) is a voluntary youth movement which promotes intangible aspects of Indian cultural heritage by promoting Indian classical music, classical dance, folk music, yoga, meditation, crafts and other aspects of Indian culture; it is a movement with chapters in over 300 towns all over the world. Organises programmes for promotion of culture inside college campuses throughout the world to make students more aware about Indian and world heritage. This initiative makes education more holistic and meaningful as it highlights all that is abstract, subtle, inspiring and mystical in the world teaching one to look within oneself. Lecture and workshops are organised while explaining various aspects of the performance.",
        "img_path": "SPIC MACAY.webp",
        "asc_type": "CLUB",
        "club_type": [
            "ARTS_AND_CULTURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/spicmacay_vit_vellore/?hl=en",
            "medium": "https://medium.com/@spicmacayvitvellore",
            "linkedin": "https://in.linkedin.com/company/spicmacay-vit-vellore"
        }
    },
    {
        "serial": 85,
        "name": "YOGA CLUB",
        "description": "Yoga club help students, faculties, staff and everyone in the campus to adopt a healthy lifestyle by training them in yoga which would build a peaceful area in their lives. Yoga education helps in self-discipline and self-control, leading to immense amount of awareness, concentration and higher level of consciousness. Regular yoga sessions are arranged to enable the student to have good health, practice mental hygiene, possess emotional stability, integrate moral values, and attain higher level of consciousness. Yoga education could help to equip oneself with basic knowledge about one’s personality, to learn to handle oneself well in all life situations, to learn techniques of gaining good health, to develop a discriminative mind capable of knowing the real from the unreal and to face the dualities of life with equanimity.",
        "img_path": "YOGA CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit_yoga_club/",
            "linkedin": "https://in.linkedin.com/in/yoga-club-7979982a8"
        }
    },
    {
        "serial": 86,
        "name": "NATIONAL SERVICE SCHEME (NSS)",
        "description": "National Service Scheme (NSS) do service to understand the community in which they work; To understand themselves in relation to their community; To identify the needs and problems of the community and involve them in problem solving process. To develop among themselves a sense of social and civic responsibility; To utilise their knowledge in finding practical solution to individual and community problems; To develop competence required for group-living and sharing of responsibilities: To gain skills in mobilising community participation; To acquire leadership qualities and democratic attitude; To develop capacity to meet emergencies and natural disasters; and To practice national integration and social harmony. NSS VIT conducts yearly camp in selected villages in and around VIT.",
        "img_path": "NSS.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/nssvit_/?hl=en",
            "website": "https://nssvit.in/",
            "linkedin": "https://in.linkedin.com/in/nss-vit-vellore"
        }
    },
    {
        "serial": 87,
        "name": "SPORTS",
        "description": "Sports clubs objectives are To inculcate in the budding minds, love for the game. To help develop personalities of youngsters. To prepare youngsters for all walks of life and to toughen them up mentally to face challenges. Develop and grow the quality of sportsmanship. To create a niche for the individuals themselves, our institute, and finally their nation through excellent sporting skills. To develop a spirit of Teamwork. Club activities are carried out under physical education department.",
        "img_path": "SPORTS CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "HEALTH_&_WELLNESS"
        ],
        "socials": {}
    },
    {
        "serial": 88,
        "name": "DEVELOPERS STUDENT CLUB",
        "description": "Developers Student Club or Google Developer Groups (GDGs) provide to developers who are interested in Google's developer technology; everything from the Android, App Engine, and Google Chrome platforms, to product APIs like the Maps API, YouTube API and Google Calendar API. Run by passionate individuals in local developer communities, A group to share ideas and network with fellow developers, A place to learn about Google technologies and development tools, as well as what local companies and developers are doing with these technologies, Focused on developers and educational technical content, Open to and free for all interested.",
        "img_path": "DEVELOPERS STUDENT CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://www.dscvit.com/",
            "instagram": "https://www.instagram.com/gdscvitvellore/",
            "twitter": "https://twitter.com/gdscvit",
            "facebook": "https://www.facebook.com/gdscvitvellore",
            "medium": "https://medium.com/gdg-vit",
            "telegram": "https://t.me/joinchat/Zlq0k9DMj6cxYTQ9",
            "linkedin": "https://www.linkedin.com/company/dscvit/",
            "youtube": "https://www.youtube.com/channel/UCvT-ZJF7fXHJi9kDeCPR-zg",
            "github": "https://github.com/GDGVIT"
        }
    },
    {
        "serial": 89,
        "name": "BLOCKCHAIN COMMUNITY VIT",
        "description": "VIT Blockchain Community Club, a student led initiative, focuses on education, research and development in blockchain technology and its various applications. Members and students develop basic application knowledge at the end of each session. The overall objective is to facilitate learning, exploration, and discussion on blockchain technology among students as well as the community; to explore avenues of facilitation such as business, healthcare, mining and finance. Club activities include, quiz sessions, study/training sessions, research paper readings, projects, guest lectures and hackathon. The club plans to host regular events and workshops to cater to all skill levels with equal opportunities for all our members to participate.",
        "img_path": "VIT BLOCKCHAIN COMMUNITY.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/vit-blockchain-community",
            "instagram": "https://www.instagram.com/blockchainvit/?hl=en",
            "twitter": "https://x.com/vit_bcc?lang=en"
        }
    },
    {
        "serial": 90,
        "name": "LEO CLUB",
        "description": "Leo Club, the youth organziation of Lions Clubs International, has been established to develop and nurture the youth of this world, so as to ensure a better tomorrow, by serving the needy. The prosperity of LEO club is the prosperity of Lions club International. LEO stands for something, ie, Leadership, Experience and opportunity. We make use of every opportunity to serve the needy and make sure that every experience improves our leadership qualities through social service. We provide the youth of the world with an opportunity for development and contribution, individually and collectively, as responsible members of the local, national and international community.” Leo club members around the world fulfill this objective every day.",
        "img_path": "LEO CLUB.webp",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/vit_leo_club/?hl=en",
            "medium": "https://leoclubvit.medium.com/",
            "website": "https://www.e-leoclubhouse.org/sites/vituniversity/",
            "linkedin": "https://in.linkedin.com/company/vit-leo-club",
            "facebook": "https://www.facebook.com/vitlionsclub/"
        }
    },
    {
        "serial": 91,
        "name": "APPLE DEVELOPER'S GROUP (ADG)",
        "description": "Apple Developers Group (ADG) is a technical chapter established under Apple University Program. Helps to understand the latest technologies required to develop IOS applications. Provide and Apple development environment for the IOS developers. ADG encourages as well as assists budding developers to become the better version of them. We excel in the fields of iOS app development and Web app development. Various workshops and technical events are organized for the students where they are mentored to build up their skill set. Hack-a-thon are also organized to bring forth supercalifragilisticexpialidocious solutions for a range of real-world problems.",
        "img_path": "Apple Developers Group.webp",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "facebook": "https://www.facebook.com/vitios",
            "twitter": "https://twitter.com/adgvit",
            "instagram": "https://www.instagram.com/adgvit/",
            "website": "https://adg-vit.github.io/"
        }
    },
    {
        "serial": 92,
        "name": "ASSAMESE LITERARY ASSOCIATION (ENAJORI)",
        "description": "\"Enajori\" is a wonderful Assamese word that encapsulates an invisible yet powerful connection of love, affection, and care. At Vellore Institute of Technology, an Assamese Literary Association is dedicated to fostering these bonds among students through literature and language. The association hosts various events, such as literary affairs, seminars, contests, magazines, and newsletters, to promote the Assamese language and inspire college students to explore and appreciate its rich cultural heritage.",
        "img_path": "ASSAMESE LITERARY ASSOCIATION (ALA).webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "twitter": "https://x.com/enajori_vit?lang=en",
            "linkedin": "https://in.linkedin.com/company/enajori-the-assamese-literary-association",
            "instagram": "https://www.instagram.com/enajori_vit/",
            "youtube": "https://www.youtube.com/@enajori_vit"
        }
    },
    {
        "serial": 93,
        "name": "ODISHA LITERARY ASSOCIATION (UTKAL SAMAJ)",
        "description": "Utkal Samaj is a socio-cultural organization that promotes and preserves the culture and traditions of the Odia community. The organization is in association with Student Welfare of VIT Vellore. It aims to preserve and promote the language, art, literature, and culture of Odisha, a state in eastern India. The club will be instrumental in recognizing and promoting the works of Odia writers and poets, as well as in promoting education and literacy in the state.\nThe organization provides a platform for Odias by origin living together to come forward and celebrate. Utkal Samaj organizes various cultural and social events throughout the year, including Odia festivals like Raja, Nua Khai, Ratha Yatra, and Utkal Divas, as well as cultural programs, music and dance performances, and other events. The community will been instrumental in promoting the welfare of the Odia community and will work on various social and charitable initiatives.",
        "img_path": "ODISHA LITERARY ASSOCIATION CLUB (OLA).webp",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/utkalsamaj_vit/",
            "linkedin": "https://in.linkedin.com/company/odisha-literary-association",
            "facebook": "https://www.facebook.com/UtkalSamaj.OLA/"
        }
    },
    {
        "serial": 94,
        "name": "YUVA TOURISM CLUB",
        "description": "The YUVA Tourism Club at VIT is a vibrant community dedicated to fostering a love for travel and cultural exploration. The club organizes various trips, events, and activities that allow students to experience diverse destinations, understand global cultures, and promote sustainable tourism. Whether it's trekking, exploring heritage sites, or learning about local traditions, YUVA Tourism Club aims to ignite the wanderlust in students while encouraging responsible travel.",
        "img_path": "YTC.jpg",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "website": "https://ytc.tourism.gov.in/"
        }
    },
    {
        "serial": 95,
        "name": "STANDARDS CLUB",
        "description": "The BIS Standards Club at VIT Vellore, founded in 2023, is dedicated to raising awareness about standardization, quality control, and certification processes among students. With a focus on bridging the gap between academic learning and industry practices, the club strives to educate students on both Indian and international standards that are pivotal for India's growth as a global manufacturing and service hub. The club organizes workshops, seminars, and industry expert interactions to foster research and prepare students for careers in quality management, aiming to equip them with the knowledge to excel in the ever-evolving landscape of global standards.",
        "img_path": "STANDARDS CLUB.jpg",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/standardsclubvit/?hl=en",
            "website": "https://www.standardsvit.live/",
            "linkedin": "https://in.linkedin.com/in/standards-club-vit-b512a829a"
        }
    },
    {
        "serial": 96,
        "name": "SPANISH LITERARY ASSOCIATION (SLA)",
        "description": "The Spanish Literary Association (SLA) at VIT Vellore is a dynamic community that celebrates the Spanish language and its diverse cultural heritage. Situated within the School of Social Sciences and Languages, the club offers students an opportunity to immerse themselves in Spanish literature, enhance their linguistic skills, and explore the vibrant traditions and history of Hispanic cultures. Through literary discussions, cultural events, and language sessions, the SLA fosters a deep appreciation for the Spanish-speaking world and encourages students to broaden their global perspective.",
        "img_path": "SLA.jpeg",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/company/spanish-literary-association-vit"
        }
    },
    {
        "serial": 97,
        "name": "ANTI DRUG CLUB (ADC)",
        "description": "The Anti-Drug Club (ADC) at VIT Vellore is committed to raising awareness about the dangers of drug abuse and promoting a healthy, drug-free lifestyle among students. Through impactful campaigns, workshops, and interactive sessions, the club educates the campus community on the physical, mental, and social consequences of substance abuse. ADC strives to create a supportive environment that empowers students to make informed choices, stand against peer pressure, and contribute to a safer and healthier society.",
        "img_path": "ADC.jpg",
        "asc_type": "CLUB",
        "club_type": [
            "SOCIAL_OUTREACH"
        ],
        "socials": {
            "linkedin": "https://in.linkedin.com/in/anti-drug-club-vit-925085331",
            "instagram": "https://www.instagram.com/adc.vit/?hl=en"
        }
    },
    {
        "serial": 98,
        "name": "THE WHITEHATS CLUB",
        "description": "The Whitehats Club at VIT Vellore is a tech-driven community dedicated to ethical hacking, cybersecurity, and digital forensics. With a mission to promote cyber awareness and responsible internet practices, the club trains students in identifying vulnerabilities, defending digital infrastructures, and understanding the principles of ethical hacking. Through workshops, Capture the Flag (CTF) competitions, and expert sessions, Whitehats equips members with hands-on skills to tackle real-world cybersecurity challenges, fostering the next generation of ethical tech professionals.",
        "img_path": "TWC.jpg",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/whitehats.vit/",
            "linkedin": "https://www.linkedin.com/company/thewhitehatsclub",
            "website": "https://twhvitc.github.io/"
        }
    },
    {
        "serial": 99,
        "name": "VINNOVATEIT CLUB",
        "description": "VinnovateIT at VIT Vellore is a vibrant and imaginative tech community where curiosity meets innovation in the ever-evolving world of computer science. Designed as a haven for passionate problem-solvers and creative thinkers, the club encourages exploration across domains like app development, machine learning, web tech, and more. With a whimsical spirit — often likened to the magic of Hogwarts — VinnovateIT blends fun with functionality, offering hands-on projects, peer learning, and a space where ideas come alive and tech dreams take flight.",
        "img_path": "VINNOVATEIT.jpeg",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/devclub_iitd/?hl=en",
            "linkedin": "https://in.linkedin.com/company/v-innovate-it",
            "website": "https://vinnovateit.com/"
        }
    },
    {
        "serial": 100,
        "name": "JAPANESE LITERARY ASSOCIATION",
        "description": "The Japanese Literary Association (JLA) at VIT Vellore is a culturally immersive club that celebrates the beauty of the Japanese language, literature, and traditions. Through language sessions, literature discussions, and cultural events, the club offers students a gateway into Japan’s rich artistic heritage — from classic haikus and modern novels to anime, folklore, and festivals. JLA provides a platform for enthusiasts to deepen their appreciation of Japanese culture while developing linguistic skills in a vibrant and inclusive community.",
        "img_path": "",
        "asc_type": "CLUB",
        "club_type": [
            "LITERATURE"
        ],
        "socials": {}
    },
    {
        "serial": 101,
        "name": "GEOSPATIAL CLUB",
        "description": "The Geospatial Club at VIT Vellore is a student-driven community focused on Geographic Information Systems (GIS), remote sensing, spatial analysis, and cutting-edge mapping technologies. Dedicated to bridging the gap between theory and real-world application, the club offers hands-on learning experiences, workshops, and collaborative projects that empower members to tackle global challenges using geospatial solutions. It’s a hub for curious minds passionate about understanding and visualizing the world through the lens of data and location intelligence.",
        "img_path": "GEOSPATIAL CLUB.jpeg",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "website": "https://www.geospatialvit.site/",
            "instagram": "https://www.instagram.com/geospatialvit/",
            "linkedin": "https://www.linkedin.com/company/geospatial-club"
        }
    },
    {
        "serial": 102,
        "name": "MATHVERSE CLUB",
        "description": "The Mathverse Club at VIT Vellore is a vibrant community for math enthusiasts who love exploring the fascinating world of numbers, patterns, and problem-solving. The club organizes workshops, quizzes, and challenges that encourage critical thinking and creativity, helping members deepen their understanding of mathematical concepts beyond the classroom. Whether it’s puzzles, competitions, or collaborative learning, Mathverse is the perfect space to ignite your passion for math and connect with like-minded peers.",
        "img_path": "MATHVERSE.jpg",
        "asc_type": "CLUB",
        "club_type": [
            "TECHNICAL"
        ],
        "socials": {
            "instagram": "https://www.instagram.com/mathverse_vit/"
        }
    },
    {
        "serial": 103,
        "name": "ADDITIVE MANUFACTURING SOCIETY OF INDIA (AMSI)",
        "description": "Additive Manufacturing Society of India (AMSI) student’s chapter promote state-of-the art 3D Printing and additive manufacturing technology and expand  in all the aspects of additive manufacturing such as R&D, manufacturing. The chapter ensures that no one is deprived of the emerging manufacturing techniques and get hands on with 3D printers with experience of all product designing software. Being a new and developing technique it will cater all the interests of beginners to a lot of opportunities and research on this topic. Moreover, it plans everyone to get familiar with designing and establish miniature working models which will help in visualization by converting innovative designs to real life prototypes for day to day use.",
        "img_path": "AMSI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/amsi-vitvellore",
            "facebook": "https://www.facebook.com/AMSIVIT/",
            "instagram": "https://www.instagram.com/amsi.vit/?hl=en"
        }
    },
    {
        "serial": 104,
        "name": "AMERICAN INSTITUTE OF CHEMICAL ENGINEERS (AICHE)",
        "description": "American Institute of Chemical Engineers (AIChE) Vision is to Provide Value as: The Global Leader of the chemical Engineering profession, The Lifetime Center for professional & personal growth, and security of chemical engineers, The Foremost Catalyst in applying chemical engineering expertise in meeting societal needs. Mission: Promote excellence in chemical engineering education and global practice, Advance the development and exchange of relevant knowledge, Uphold and advance the profession's standards, ethics and diversity, Promote safety in every aspect of chemical engineering, Enhance the lifelong career development and financial security of chemical engineers through products, services, networking, and advocacy, Stimulate collaborative efforts among industry, universities, government, and professional societies, Encourage other engineering and scientific professionals to participate in AIChE activities; Advocate public policy that embraces sound technical and economic information and that represents the interest of chemical engineers, Facilitate public understanding of technical issues; and Achieve excellence in operations of the Institute.",
        "img_path": "AICHE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "facebook": "https://www.facebook.com/aichevit/"
        }
    },
    {
        "serial": 105,
        "name": "AMERICAN SOCIETY OF CIVIL ENGINEERS (ASCE)",
        "description": "American Society of Civil Engineers (ASCE), a world student association has perceived ASCE-VIT as an official understudy part. Chapter is committed to inspiring motivating personalities in the field of civil engineering.. Aim to make the students competent enough to face cumbersome situations during their career and to unveil the decisions taken by the brightest civil minds of history as well as of present. It aims to raise the bar of education and standard and get students adhered to some substantial qualities which are must for a Civil Engineer. Chapter organizes, symposiums, workshops, guest lecture, seminars and other events which have been well-known and fruitful among students.",
        "img_path": "ASCE-VIT.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "facebook": "https://www.facebook.com/asceVIT/",
            "linkedin": "https://in.linkedin.com/company/ascevit",
            "instagram": "https://www.instagram.com/asce.vit/"
        }
    },
    {
        "serial": 106,
        "name": "AMERICAN SOCIETY OF HEATING, REFRIGERATING AND AIR-CONDITIONING ENGINEERS (ASHRAE)",
        "description": "Ashrae VIT Chapter helps to serve humanity by advancing the arts and sciences of heating, ventilation, air conditioning, refrigeration and their allied fields. To help the society advancing human well-being through sustainable technology for the built environment. The Society and its members focus on building systems, energy efficiency, indoor air quality, refrigeration and sustainability within the industry. Through research, standards writing, publishing and continuing education, ASHRAE shapes tomorrow’s built environment today.",
        "img_path": "ASHRAE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/ashrae__vit/?hl=en",
            "linkedin": "https://in.linkedin.com/in/ashrae--vit",
            "facebook": "https://www.facebook.com/p/ASHRAE-VIT-100064009185782/?_rdr"
        }
    },
    {
        "serial": 107,
        "name": "AMERICAN SOCIETY OF MECHANICAL ENGINEERS (ASME)",
        "description": "American Society of Mechanical Engineers (ASME) helps the global engineering community develop solutions to real world challenges. ASME is a not-for-profit professional organization that enables collaboration, knowledge sharing and skill development across all engineering disciplines, while promoting the vital role of the engineer in society. ASME codes and standards, publications, conferences, continuing education and professional development programs provide a foundation for advancing technical knowledge and a safer world. Mission: ASME’s mission is to serve diverse global communities by advancing, disseminating and applying engineering knowledge for improving the quality of life; and communicating the excitement of engineering. Vision: ASME aims to be the essential resource for mechanical engineers and other technical professionals throughout the world for solutions that benefit humankind. Members get a chance to learn new technologies, keep your skills up to date, explore solutions to technical problems, advance your career and maintain the standard of ASME",
        "img_path": "ASME.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/american-society-of-mechanical-engineers-asme-vit-vellore",
            "instagram": "https://www.instagram.com/asme.vit/?hl=en"
        }
    },
    {
        "serial": 108,
        "name": "ASSOCIATION FOR COMPUTING MACHINERY (ACM)",
        "description": "Association for Computing Machinery (ACM) brings together computing educators, researchers, and professionals to inspire dialogue, share resources, and address the field's challenges. As the world’s largest computing society, ACM strengthens the profession's collective voice through strong leadership, promotion of the highest standards, and recognition of technical excellence. ACM supports the professional growth of its members by providing opportunities for life‐long learning, career development, and professional networking. Founded at the dawn of the computer age, ACM’s reach extends to every part of the globe. Members get a chance in fostering networking opportunities that strengthen ties within and across countries and technical communities. Their actions enhance ACM’s ability to raise awareness of computing’s important technical, educational, and social issues around the world.",
        "img_path": "ACM.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "website": "https://www.acmvit.in/",
            "instagram": "https://www.instagram.com/acmvit/?hl=en",
            "github": "https://github.com/acm-vit",
            "linkedin": "https://in.linkedin.com/company/acmvit",
            "facebook": "https://www.facebook.com/acmvitvellore/"
        }
    },
    {
        "serial": 109,
        "name": "ASSOCIATION OF DESIGNERS OF INDIA (ADI)",
        "description": "Association of Designers of India (ADI) vision is to be a world class network representing professional interests of Indian Design community, creating a meaningful interface between design professionals, people as users, the industry, education institutions and the policy makers. Key Objectives of ADI: Create a strong network of designers from India, Build a platform for sharing design thinking and design case studies. Lead the design community towards better quality of service, responsible design and smooth interface with the industry, Promote compliance of ethical practice code amongst design community in India, Increase awareness of \"good design\" amongst the \"people\" and \"industry\", through out-reach programs, publications, events & installations. Encourage Chapter level activity in promoting design and design related activities, Build a national movement of young designers, ADI shall network with national and international bodies related with the profession, Promote India as a design service destination.",
        "img_path": "ADI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/adi_vitv/",
            "linkedin": "https://in.linkedin.com/company/adi-vit"
        }
    },
    {
        "serial": 110,
        "name": "ASSOCIATION OF ENERGY ENGINEERS (AEE)",
        "description": "The Association of Energy Engineers (AEE), is a professional society of members in more than 100 countries. The mission of AEE is “to promote the scientific and educational interests of those engaged in the energy industry and to foster action for Sustainable Development.” AEE offers a full array of informational outreach programs including seminars (live and online), conferences, journals, books, and certification programs. Chapter is dedicated to furthering education in energy and management. Members get a chance to create a communication network around the world of energy professionals sharing information and experience.",
        "img_path": "AEE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/school/aee-vit/",
            "facebook": "https://www.facebook.com/aeevitchapter/",
            "instagram": "https://www.instagram.com/aee.vit/?hl=en"
        }
    },
    {
        "serial": 111,
        "name": "COMPBIO CELL - RSG INDIA",
        "description": "The CompBio Cell - RSG India chapter at VIT Vellore is part of a nationwide network dedicated to advancing the field of computational biology and bioinformatics. The chapter connects students passionate about applying computational techniques to solve biological problems, fostering learning through workshops, seminars, and collaborative projects. By bridging biology, computer science, and data analysis, CompBio Cell empowers members to explore cutting-edge research and innovations in life sciences, preparing them for impactful careers in this interdisciplinary domain.",
        "img_path": "COMPBIO CELL.jpg",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/compbiocellvit/?hl=en"
        }
    },
    {
        "serial": 112,
        "name": "COMPUTER SOCIETY OF INDIA (CSI)",
        "description": "Computer Society of India ( CSI) is the first and largest body of computer professionals in India. It was started on 6 March 1965 by a few computer professionals and has now grown to be the national body representing computer professionals. CSI is a non-profit professional society and meet to exchange views and information learns and share ideas. The wide spectrum of members is committed to the advancement of theory and practice of Computer Engineering and Technology Systems, Science and Engineering, Information Processing and related Arts and Sciences. We facilitate Research, Knowledge Sharing, Learning and Career Enhancement among all categories of IT professionals. Inspire, nurture and assist students to integrate into the IT community. Percolate benefits of IT advancement to all sections of Indian Society by conducting workshops, technical and non-technical events, conference, hackathon, with utmost attention to every little detail across these spectra of events. We encourage a professional work environment with equal focus on results and efforts, trying for versatility in every domain with quality participation from every member to ensure maximum holistic development.",
        "img_path": "CSI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "website": "https://csivit.com/",
            "linkedin": "https://in.linkedin.com/company/csivitu",
            "instagram": "https://www.instagram.com/csivitu/?hl=en",
            "github": "https://github.com/csivitu",
            "facebook": "https://www.facebook.com/csivitu/"
        }
    },
    {
        "serial": 113,
        "name": "IEEE - TECHNOLOGY AND ENGINEERING MANAGEMENT SOCIETY ( IEEE-TEMS)",
        "description": "IEEE-Technology and Engineering Management Society (IEEE-TEMS in VIT train members to maintain essential engineering management skills; Support the leadership career path of members; Foster active knowledge transfer between the academic and practicing communities. To advance, enhance, and improve essential management and leadership knowledge and skills of members. Make students to be the premier resource of essential management and leadership knowledge. The Field of Interest of the TEMS encompasses the management sciences and practices required for defining, implementing, and managing engineering and technology. Specific topics of interest include, but are not limited to: technology policy development, assessment, and transfer; research; product design and development; manufacturing operations; innovation and entrepreneurship; program and project management; strategy; education and training; organizational development and human behavior; transitioning to management; and the socioeconomic impact of engineering and technology management.",
        "img_path": "IEEE - TEMS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieeetemsvit.in/",
            "instagram": "https://www.instagram.com/ieeetemsvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-tems"
        }
    },
    {
        "serial": 114,
        "name": "IEEE -COMMUNICATIONS SOCIETY (IEEE-COMSOC)",
        "description": "IEEE Communication Society (IEEE ComSoc) members contribute new ideas and information to our collective knowledge, developing higher industry standards, and changing the way we all communicate, for the better. Society promotes technological innovation and fosters creation and sharing of information among the global technical community. The Society provides services to members for their technical and professional advancement and forums for technical exchanges among professionals in academia, industry, and public institutions. To bring the world together in harmony through communications and networking technology research, application, education, and incubation of new ideas. Society members can participate in the development and implementation of standards in the communications field in areas such as network management and optical communications. Supporting the leadership career path of members and continuing education for communications professionals.",
        "img_path": "IEEE - COMSOC.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "instagram": "https://www.instagram.com/vitieeecomsoc/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieeecomsocvit",
            "facebook": "https://www.facebook.com/IEEE.ComSoc.VIT/"
        }
    },
    {
        "serial": 115,
        "name": "IEEE CIRCUITS AND SYSTEMS (IEEE-CAS)",
        "description": "IEEE Circuits and Systems (IEEE CAS) Society is the leading organization that promotes the advancement of the theory, analysis, design, tools, and implementation of circuits and systems. The field spans their theoretical foundations, applications, and architectures, as well as circuits and systems implementation of algorithms for signal and information processing. The Society brings engineers, researchers, scientists and others involved in circuits and systems applications access to the industry’s most essential technical information, networking opportunities, career development tools and many other exclusive benefits. Our Mission is to foster CASS members across disciplines to address humanity’s grand challenges by conceiving and pioneering solutions to fundamental and applied problems in circuits and systems. The Society’s unique and profound expertise in Circuits, Systems, Signals, Modeling, Analysis, and Design can have a decisive impact on important issues such as Sustainable Energy, Bio-Health, Green Information Technology, Nano-Technology, and Scalable Information Technology Systems.",
        "img_path": "IEEE- CAS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "instagram": "https://www.instagram.com/ieee_cas_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-circuits-and-systems-vit",
            "facebook": "https://www.facebook.com/profile.php?id=100067787119412&locale=ml_IN#"
        }
    },
    {
        "serial": 116,
        "name": "IEEE COMPUTER SOCIETY (IEEE-CS)",
        "description": "IEEE Computer Society (IEEE-CS), the leading provider of technical information, community services, and personalized services to the world’s computing professionals. Be essential to the global technical community and computer professionals everywhere and be universally recognized for the contributions of technical professionals in developing and applying technology to improve global conditions. The purposes of the Society shall be scientific, literary, and educational in character. The Society shall strive to advance the theory, practice, and application of computer and information processing science and technology and shall maintain a high professional standing among its members. The Society shall promote cooperation and exchange of technical information among its members. The scope of the society shall encompass all aspects of theory, design, practice, and application relating to computer and information processing science and technology.",
        "img_path": "IEEE - CS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieeecsvit.com/",
            "instagram": "https://www.instagram.com/ieeecs_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-cs-vit"
        }
    },
    {
        "serial": 117,
        "name": "IEEE ENGINEERING IN MEDICINE & BIOLOGY SOCIETY (IEEE-EMBS)",
        "description": "IEEE Engineering in Medicine and biology Society (IEEE-EMBS) is the world’s largest international society of biomedical engineers. Chapter benefits both humanity and its members by: advancing medicine and biology through the application of engineering sciences and technology, promoting the profession of biomedical engineering, fostering professional development. IEEE EMBS members are focused on the development and application of engineering concepts and methods to provide new solutions to biological, medical and healthcare problems. The field encompasses: Diagnostic Systems, Therapeutic Systems, Healthcare and Bio information Systems, Technologies & Methodologies. Our members design the electrical circuits that make a pacemaker run, create the software that reads an MRI, and help develop the wireless technologies that allow patients and doctors to communicate over long distances. They are researchers and educators, technicians and clinicians—biomedical engineers are the link between science and life science, creating innovations in healthcare technology for the benefit of all humanity.",
        "img_path": "IEEE-EMBS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ieee-embs-chapter-vit",
            "instagram": "https://www.instagram.com/embs_vit/?hl=en",
            "website": "https://embs-vit.netlify.app/",
            "facebook": "https://www.facebook.com/IEEE.EMBS.VIT/"
        }
    },
    {
        "serial": 118,
        "name": "IEEE INDUSTRIAL APPLICATIONS SOCIETY (IEEE-IAS)",
        "description": "IEEE- Industrial Applications Society (IEEE IAS), as a transnational organization, is interested in advancement of the theory and practice of electrical and electronic engineering in the development, design, manufacture and application of electrical systems, apparatus, devices and controls to the processes and equipment of industry and commerce; promotion of safe, reliable and economic installations; industry leadership in energy conservation and environmental, health, and safety issues; creation of voluntary engineering standards and recommended practices; and the professional development of its members. The role of our chapter is to conduct workshops, events, conferences and make sure you are connected to the outside world. Through a network of over globally, events and national and international conferences, the society keeps members abreast of current developments in the area of technology. IAS enriches both its individual members and the industry as a whole through the sharing of industry-related solutions.",
        "img_path": "IEEE - IAS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ieeeiasvit",
            "instagram": "https://www.instagram.com/ieeeiasvit/?hl=en",
            "facebook": "https://www.facebook.com/ieeeiasvit/"
        }
    },
    {
        "serial": 119,
        "name": "IEEE NUCLEAR AND PLASMA SCIENCES AND SOCIETY (IEEE-NPSS)",
        "description": "IEEE Nuclear and Plasma Sciences and Society (IEEE-NPSS) covers the fields of Fusion Technology, Nuclear Medical and Imaging Sciences, Particle Accelerator Science and Technology, Pulsed Power Systems, Radiation Effects, Radiation Instrumentation, Plasma Sciences and Applications, Standards for Nuclear Instruments and Detectors, and Computer Applications in Nuclear and Plasma Sciences. Regular workshops and other events are organised to covers the fields of Fusion technology, Nuclear sciences, Radiation effects, Plasma sciences and applications and Computer applications in nuclear and plasma sciences. Chapter supports the growth of the profession in Nuclear and plasma science. Members can get involved in the affairs of NPSS and help direct and further promote our profession and make further valuable contacts. Help members to improve their abilities, explore the talent in them and can know more about the advance changes done in the field of nuclear sciences and their applications.",
        "img_path": "IEEE -NPSS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ieee-npss-vit-chapter",
            "facebook": "https://www.facebook.com/ieeenpss.vit/",
            "instagram": "https://www.instagram.com/ieee_npss_vit/?hl=en"
        }
    },
    {
        "serial": 120,
        "name": "IEEE POWER AND ENERGY SOCIETY (IEEE-PES)",
        "description": "IEEE Power and Energy Society (IEEE PES), aims to spread awareness about conservation of energy and to educate everyone about the latest trends in the safe, sustainable, economic and reliable conversion, generation, transmission, distribution and storage of electrical energy. The chapter strives to make this world greener by advocating the use of renewable emergy and to educate people about the best ways to do it. The chapter remains up-to-date about the newest innovations in the field of power and energy and incorporates these innovations through various events throughout the year. Every year, through various events like Scopes, Electrohunt and DIY, we teach the eager participants new technologies in the field of power and energy in a very fun, interesting and interactive manner.",
        "img_path": "IEEE - PES.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieee-pes-vit.github.io/IEEEPESVIT/",
            "linkedin": "https://in.linkedin.com/company/ieee-power-and-energy-society-vitc",
            "instagram": "https://www.instagram.com/ieeepesvit/?hl=en",
            "facebook": "https://www.facebook.com/groups/vit.ieee.pes/",
            "github": "https://github.com/IEEE-PES-VIT"
        }
    },
    {
        "serial": 121,
        "name": "IEEE PROFESSIONAL COMMUNICATION SOCIETY (IEEE-PCS)",
        "description": "IEEE-Professional communication Society (IEEE-PCS) is chapter aimed at building professionalism in the society by advance technical and scientific communication as an essential element of engineering. Help engineers, scientists, and other technically oriented professionals to communicate better in the workplace-both in speaking and in writing, both verbally and nonverbally. Promote and facilitate leading-edge education and training of engineers of VIT in communication theory and practice. Facilitate the study, development, improvement, and promotion of effective techniques for preparing, organizing, processing, editing, collecting, conserving, teaching, and disseminating any form of technical and non-technical information by and to individuals or groups by any method of communication. It also includes technical, scientific, industrial, and other activities that contribute to the techniques and products used in this field.",
        "img_path": "IEEE - PCS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieee-pcs-vit-v.github.io/website/",
            "instagram": "https://www.instagram.com/ieeepcsvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieeepcsvit",
            "facebook": "https://www.facebook.com/PCSVIT/"
        }
    },
    {
        "serial": 122,
        "name": "IEEE SIGNAL PROCESSING SOCIETY (IEEE-SPS)",
        "description": "IEEE Signal Processing Society Student (IEEE - SPS) Signal processing is the enabling technology for the generation, transformation, extraction, and interpretation of information. It comprises the theory, algorithms with associated architectures and implementations, and applications related to processing information contained in many different formats broadly designated as signals. Mission Statement: The Signal Processing Society is an international organization whose purpose is to: advance and disseminate state-of-the-art scientific information and resources; educate the signal processing community; and provide a venue for people to interact and exchange ideas. Vision Statement: The Signal Processing Society is a dynamic organization that is the preeminent source of signal processing information and resources to a global community. We do this by: being a one-stop source of signal processing resources; providing a variety of high quality resources to a variety of users in formats customized to their interests; adapting to a rapidly changing technical community; and being intimately involved in the education of signal processing professionals at all levels.",
        "img_path": "IEEE - SPS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ieee-sps-vit",
            "instagram": "https://www.instagram.com/ieee_sps_vitv/",
            "facebook": "https://www.facebook.com/vitieeesps/"
        }
    },
    {
        "serial": 123,
        "name": "IEEE SOCIETY ON SOCIAL IMPLICATIONS OF TECHNOLOGY (IEEE-SSIT)",
        "description": "The Society on Social Implications of Technology (SSIT) of the Institute of Electrical and Electronics Engineers (IEEE) is concerned with how technology impacts the world, and with how the application of technology can improve the world. The Society focuses on issues such as: humanitarian engineering; environmental issues including climate change, green technologies, and sustainable design; privacy and security; other economic, health, and safety implications of technology; engineering ethics and professional responsibility; engineering education including k-12 and engineering education in social implications of technology; history of technology; public policy related to engineering, technology and science; health and healthcare technologies and impact; reliable energy and social issues related to energy, and social issues of information technology and telecommunications.",
        "img_path": "IEEE - SSIT.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ssitvit.netlify.app/",
            "instagram": "https://www.instagram.com/ieeessit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-ssit-vit",
            "facebook": "https://www.facebook.com/SSITVIT/"
        }
    },
    {
        "serial": 124,
        "name": "IEEE WOMEN IN ENGINEERING (IEEE-WIE)",
        "description": "IEEE Women in Engineering (IEEE-WIE) is one of the largest international professional organization which promotes women scientists and engineers and is dedicated to advancing technology for the benefit of society. The organization plays a pivot role in inspiring girls to pursue their interests in engineering. Develop skills, gain knowledge and display their talents. We seek to recognize women's outstanding achievements, advocate women in leadership roles, facilitate the development of programs and activities that promote the entry into and retention of women in engineering programs. IEEE WIE envisions a vibrant community of IEEE women and men innovating the world of tomorrow. A good number of skilled women work collectively using their various talents to innovate for the benefit of mankind. The organization strives to organize workshops at notable technical conferences. IEEE-WIE in VIT recruits girl and helps to bring out the best in them by teaching various technical skills and encourages for striving for the best.",
        "img_path": "IEEE - WIE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "instagram": "https://www.instagram.com/ieee_wie_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-women-in-engineering-vit",
            "facebook": "https://www.facebook.com/IEEEWIEVIT/"
        }
    },
    {
        "serial": 125,
        "name": "IEEE-MICROWAVE THEORY AND TECHNIQUES SOCIETY (IEEE-MTTS)",
        "description": "IEEE Microwave Theory and Techniques Society (IEEE-MTTS) is a transnational society with more than 11,000 members and 150 chapters worldwide. Our Society promotes the advancement of microwave theory and its applications, including RF, microwave, millimeter-wave, and terahertz technologies. For more than 60 years the MTT-S has worked to advance the professional standing of its members and enhance the quality of life for all people through the development and application of microwave technology. The activities of MTT-S include a broad spectrum of conferences, workshops, publications and professional education programs. Our professional venues provide a great opportunity for networking with experienced innovators, experts, and practitioners. Our volunteer programs provide for development of critical, non-technical skills that enable you to be more effective professionally.",
        "img_path": "IEEE - MTTS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ieee-mtts-vit",
            "instagram": "https://www.instagram.com/vit.ieee.mtts/?hl=en",
            "youtube": "https://youtube.com/@ieee-mtts-vit-vellore"
        }
    },
    {
        "serial": 126,
        "name": "IEEE-ROBOTICS & AUTOMATION SOCIETY (IEEE-RAS)",
        "description": "The IEEE Robotics and Automation Society's (IEEE-RAS) objectives are scientific, literary and educational in character. The Society strives for the advancement of the theory and practice of robotics and automation engineering and science and of the allied arts and sciences, and for the maintenance of high professional standards among its members, all in consonance with the Constitution and Bylaws of the IEEE and with special attention to such aims within the Field of Interest of the Society. Our Mission is to foster the development and facilitate the exchange of scientific and technological knowledge in Robotics and Automation that benefits members, the profession and humanity. Our Vision is to be the most recognized and respected global organization in Robotics and Automation.",
        "img_path": "IEEE - RAS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "instagram": "https://www.instagram.com/ieeerasvit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-ras-vit",
            "medium": "https://medium.com/ieee-ras-vit",
            "website": "https://ieeeras-vit.vercel.app/",
            "twitter": "https://x.com/ieeeras_vit"
        }
    },
    {
        "serial": 127,
        "name": "INDIA SMART GRID FORUM (ISGF)",
        "description": "India Smart Grid Forum (ISGF) is a public private partnership initiative of Ministry of Power (MoP), Government of India for accelerated development of smart grid technologies in the Indian power sector. ISGF provide a mechanism through which academia, industry, utilities and other stakeholders could participate in the development of Indian smart grid systems and provide relevant inputs to the government’s decision-making. Mission: To help the Indian power sector deploy smart grid technologies in an efficient, cost effective, innovative and scalable manner by bringing together all key stakeholders and enabling technologies, To create a platform for public and private stakeholder members, research institutions and power utilities to exchange ideas and information on smart grids and develop use case scenarios for India. To conduct research on the capabilities of smart grids in the Indian context through case studies, cost-benefit analysis, study of technical advancements in renewable energy sources and other ancillary activities.",
        "img_path": "ISGF.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "facebook": "https://www.facebook.com/profile.php?id=100057375702664&locale=en_GB#"
        }
    },
    {
        "serial": 128,
        "name": "INDIAN INSTITUTE OF CHEMICAL ENGINEERS (IICHE)",
        "description": "Indian Institute of Chemical Engineers (IIChE) -VIT is a forum of chemical engineers. Our vision is to equip and empower the future of chemical engineering and engineers and their academic precincts. We aspire to constantly keep ourselves updated and work towards become an exemplary chapter. To promote the profession of its members through its for Chemical Engineers. Chapter contribute to the development of chemical engineering through activities involving faculty and student members. The chapter has always been very ardent about the gain of constructive knowledge in chemical engineering. Several guest lectures on safety, manufacture and production sectors have been conducted in order to broaden the students’ perspectives.",
        "img_path": "IICHE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/iiche-vit",
            "website": "https://iichevit.com/",
            "instagram": "https://www.instagram.com/iichevit/?hl=en"
        }
    },
    {
        "serial": 129,
        "name": "INDIAN SOCIETY FOR TECHNICAL EDUCATION (ISTE)",
        "description": "The Indian Society for Technical Education (ISTE) is the leading National Professional non-profit Society for the Technical Education System in our country with the motto of Career Development of Teachers and Personality Development of Students and overall development of our Technical Education System. ISTE-VIT aims at providing technical education to students in innovative and efficient ways for overall skill development. Our objective is to create and assist top quality professional engineers and technicians whose skills and capabilities are sought after by larger industries and organizations. We organize technical workshops, Hack-A-thons, Code-A-thons to find and enhance the hidden skills in the students.",
        "img_path": "ISTE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/indian-society-for-technical-education",
            "website": "https://istevit.in/",
            "instagram": "https://www.instagram.com/iste_vit_vellore/?hl=en",
            "youtube": "https://youtube.com/@istevitvellore"
        }
    },
    {
        "serial": 130,
        "name": "INDUSTRIAL DESIGN SOCIETY OF AMERICA (IDSA)",
        "description": "Industrial Design Society of America (IDSA) student chapter for Industrial Designer, the professional practice of designing products used by millions of people around the world every day. Industrial designers not only focus on the appearance of a product, but also on how it functions, is manufactured and ultimately the value and experience it provides for users. Every product you have in your home and interact with is the result of a design process and thousands of decisions aimed at improving your life through design. Various workshops and events to design ideation of cars and toasters to smart phones and life-saving medical equipment etc are the part of this society. The breadth of work and social impact created at the hands of industrial designers across the world is truly amazing.",
        "img_path": "IDSA.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/idsavit/?hl=en",
            "facebook": "https://www.facebook.com/vitidsa/"
        }
    },
    {
        "serial": 131,
        "name": "INSTITUTE ELECTRICAL & ELECTRONICS ENGINEERING (IEEE)",
        "description": "The IEEE (Institute of Electrical and Electronics Engineers) describes itself as \"the world's largest technical professional society -- promoting the development and application of electro technology and allied sciences for the benefit of humanity, the advancement of the profession, and the well-being of our members.\" The technical objectives of the IEEE focus on advancing the theory and practice of electrical, electronics and computer engineering and computer science. Chapter inculcate the spirit of inquisitiveness and science amongst students through seminars and workshops and provide an opportunity to the students to enhance their technical skills and problem solving abilities through conducting technical events. The men and women of the IEEE are the technical and scientific professionals making the revolutionary engineering advances which are reshaping our world today.",
        "img_path": "IEEE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieeevit.org/",
            "instagram": "https://www.instagram.com/ieeevitvellore/?hl=en",
            "linkedin": "https://in.linkedin.com/company/ieee-vit-vellore"
        }
    },
    {
        "serial": 132,
        "name": "INSTITUTION OF ELECTRONICS AND TELECOMMUNICATION ENGINEERS (IETE)",
        "description": "The Institution of Electronics and Telecommunication Engineers (IETE) helps imparting knowledge to young and enthusiastic engineers that will help them to grow and develop in the area of electronics and telecommunication. IETE plan and organize technical programmes and activities, such as, special lectures, workshops, seminars, exhibitions etc. for the benefit of student members on a regular basis. Provide a common platform for the student members to exchange ideas and information. Facilitate technical visits, practical training, project work etc. Encourage team work among the student members. Serve as a focal point at the institution on all aspects of professional development of the student members.",
        "img_path": "IETE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/iete_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/iete-vit"
        }
    },
    {
        "serial": 133,
        "name": "INSTITUTION OF ENGINEERS INDIA IE(I)",
        "description": "The Institution of Engineers (India) has more than one million members in 15 engineering disciplines in 114 centers or chapters in India and overseas; it is the world's largest multi-disciplinary engineering professional society in engineering and technology world. IEI envisions to be one of the largest and vibrant professional society of engineers, technologists and applied scientists in the world, covering all branches of engineering, committed to the promotion of continual professional and intellectual development and contributing significantly to the growth of technological knowledge, skill and capacity building of the highest order, demonstrated through innovative approach towards the cause of sustainable development. Our mission is to effectively promote the general advancement of engineering, engineering science and technology, and their application in India, To facilitate dissemination and exchange of information and ideas amongst the members of the profession and the persons attached to IEI. To extend value based services to the Nation, at all desired level.",
        "img_path": "IE(I).webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/iei_vit/?hl=en"
        }
    },
    {
        "serial": 134,
        "name": "INSTITUTION OF INDUSTRIAL AND SYSTEMS ENGINEERS (IISE)",
        "description": "Institution of Industrial and Systems Engineers (IISE) is the first IISE chapter to be established in India. We as industrial engineers focus on improving productivity, efficiency in various areas and support industrial engineering students and professionals involved with improving quality and productivity. To deliver a high-quality student-centred engineering education that provides distinctive, authentic and supportive experiences that inspires students to make a positive difference in Industrial engineering. We conduct various events and workshops to impart knowledge and upgrade skills of students. We strive towards solving real world problems and helping our bit towards industrial society. We as ISEs are rooted in the sciences of engineering, the analysis of systems, and the management of people.",
        "img_path": "IISE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/iise-vit-linkedin",
            "instagram": "https://www.instagram.com/iise_vit/?hl=en",
            "facebook": "https://www.facebook.com/iievitu/"
        }
    },
    {
        "serial": 135,
        "name": "INTERNATIONAL SOCIETY OF AUTOMATION (ISA)",
        "description": "The International Society of Automation (ISA) is a professional association that sets the standard for those who apply engineering and technology to improve the management, safety, and cybersecurity of modern automation and control systems used across industry and critical infrastructure. We serve both process manufacturing industries, like chemicals, food and beverage, oil and gas, and pharmaceuticals; and discrete manufacturing industries, like automotive and aerospace. ISA develops widely used global standards; certifies industry professionals; provides education and training; publishes books and technical articles. For engineers, technicians, and management engaged in industrial automation. ISA brings the right people together to create the technologies of the future and share best practices with the next generation of automation professionals.",
        "img_path": "ISA.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/international-society-of-automation-isa-vit",
            "instagram": "https://www.instagram.com/isa_vit_/?hl=en",
            "facebook": "https://www.facebook.com/isavitchapter/",
            "medium": "https://medium.com/isa-vit"
        }
    },
    {
        "serial": 136,
        "name": "SOCIETY FOR BIOLOGICAL ENGINEERING (SBE)",
        "description": "The Society for Biological Engineering (SBE), an AIChE Technological Community, is a global organization of leading engineers and scientists dedicated to advancing the integration of biology with engineering. SBE is dedicated to promoting the integration of biology with engineering and realizes its benefits through bioprocessing, biomedical and biomolecular applications. Make SBE a goal for engineers and applied scientists with interest in the broad area of biological engineering.. To develop products and services which are cost effective, relevant, and bring value to the broad biological engineering community. To infuse awareness of biological engineering among all functions and activities of AIChE, in particular; continuing education, membership, government relations, meeting programming publications. To raise interest, understanding, and recognition of engineers’ and scientists’ roles in biological engineering.",
        "img_path": "SBE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/sbe-vit",
            "facebook": "https://www.facebook.com/sbevit/"
        }
    },
    {
        "serial": 137,
        "name": "SOCIETY FOR INDUSTRIAL AND APPLIED MATHEMATICS (SIAM)",
        "description": "Society for Industrial and Applied Mathematics (SIAM) aims at dispensing required tools and knowledge for students to excel in fields of applied mathematics such as computational science, forensics, cryptography etc. SIAM is an international association that exists the strongest interactions between mathematics and other scientific and technological communities through membership activities SIAM provides internship opportunities under the field applied and computational mathematics under a wide range of corporation and institutions including reputed organization like the BELL LABS, AT & T Lab etc. Organize team projects such as undergraduate competitions and technical feats, including unique online website contests. SIAM hosts interdisciplinary activities with other department in the campus Organize undergraduate mini conference with the inclusion of reputed guest lecturers. Organize field trips SIAM section meetings, including industrial visit.",
        "img_path": "SIAM.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/siamvit/?hl=en"
        }
    },
    {
        "serial": 138,
        "name": "SOCIETY OF MANUFACTURING ENGINEERS (SME)",
        "description": "Society of Manufacturing Engineers (SME - VIT) is an international association of students, educators and professionals committed to promoting and supporting the manufacturing industry. We offer an unmatched breadth of support and resources for manufacturers. SME offers the top manufacturing technology resources and news, and produces the industry’s most valuable events. We deliver leading training and development solutions for your workforce. Our student outreach and scholarship programs help attract and empower manufacturing’s next generation. As a manufacturing chapter, SME has been extensively involved in organizing events that uphold and propagate the values and spirit of the industry. In keeping with the popular manufacturing philosophy of Continuous Improvement, we are constantly in pursuit of reform, to better ourselves, both as individuals and as a chapter as a whole.",
        "img_path": "SME.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/sme_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/smevit"
        }
    },
    {
        "serial": 139,
        "name": "SOCIETY OF AUTOMOTIVE ENGINEERS (SAE)",
        "description": "Society for Automotive Engineers (SAE)-VIT is a student chapter under the initiative of SAE India, an affiliate of SAE International which is a global association of technical experts in the aerospace, automotive and commercial-vehicle industries. We envision our recognition as a leader in connecting and educating engineers while promoting, developing and advancing aerospace, commercial vehicle and automotive engineering. The chapter endeavours towards enabling its members to gain knowledge and hands-on experience in the field of automotive through its various events, workshops and competitions. There are 10 racing (Baja & Formula), 5 aero flying, 1 moto team, drone, and bicycle design teams under SAE-VIT, which represent VIT in national and international competitions. The Chapter is open to students from all branches of engineering providing any automotive enthusiast in VIT, Vellore, the perfect platform to explore their passion for automobiles irrespective of their technical background.",
        "img_path": "SAE-VIT.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/society-of-automotive-engineers-vit-vellore-",
            "instagram": "https://www.instagram.com/sae_vit/?hl=en"
        }
    },
    {
        "serial": 140,
        "name": "SOFT COMPUTING RESEARCH SOCIETY (SCRS)",
        "description": "The Soft Computing Research Society (SCRS) chapter at VIT Vellore is a dynamic, multi-domain community driving innovation at the intersection of computer science and soft computing technologies. It offers a holistic experience through four key domains: Technical members dive into AI, programming, and cutting-edge projects; Management members hone skills in project execution and event coordination; Design and Editorial members blend creativity with tech to craft engaging visuals and content; and PR & Outreach members build valuable industry connections and manage collaborations. Together, SCRS nurtures talent across diverse skill sets to transform ideas into impactful solutions.",
        "img_path": "SCRS.jpeg",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "website": "https://www.scrsvit.in/",
            "linkedin": "https://in.linkedin.com/company/soft-computing-research-society-vit",
            "facebook": "https://www.facebook.com/p/Soft-Computing-Research-Society-VIT-100064194633426/"
        }
    },
    {
        "serial": 141,
        "name": "STUDENTS FOR THE EXPLORATION AND DEVELOPMENT OF SPACE (SEDS)",
        "description": "Students for the Exploration and Development of Space (SEDS) empowers young people to participate and make an impact in space exploration. SEDS helps students develop their technical and leadership skills by providing opportunities to manage and participate in national projects as well as to attend conferences, publish their work, and develop their professional network, in order to help students become more effective in their present and future careers in industry, academia, government, and education. Different informative events are organized throughout for the members get to explore different fields of space and develop management skills simultaneously. SEDS is working at the forefront of making Space Exploration a popular hobby and develop students’ interest in the field as a viable future career option.",
        "img_path": "SEDS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "website": "https://www.sedsvit.in/",
            "linkedin": "https://in.linkedin.com/company/sedsvit",
            "instagram": "https://www.instagram.com/sedsvit/",
            "facebook": "https://www.facebook.com/SEDSVIT/"
        }
    },
    {
        "serial": 142,
        "name": "THE BIOTECH RESEARCH SOCIETY INDIA (BRSI)",
        "description": "The Biotech Research Society of India (BRSI) is a scientific professional society dedicated to promote excellence and competence in the field of biotechnology for the benefit of mankind. We aim to promote research and development in biotechnology in India. We enable interaction between academic institutes and biotech industries; help them in resolving problems, as well make them aware of latest developments in biotech sector. We provide training in biotechnology, organize lectures, seminars and symposia on scientific programs and societal missions. Various workshops and other events are organised as part of the chapter activities for the benefit of the students interested in biotechnology.",
        "img_path": "BRSI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/brsivitvellore/?hl=en",
            "linkedin": "https://in.linkedin.com/company/brsivit",
            "facebook": "https://www.facebook.com/brsivituniversity/"
        }
    },
    {
        "serial": 143,
        "name": "THE INSTITUTION OF ENGINEERING AND TECHNOLOGY (IET)",
        "description": "IET, a UK based professional society, works as one of the oldest and well-established technical chapter in VIT. IET is an accrediting body and VIT was the first Institution to be accredited by the same. The chapter inspire, inform and influence the global engineering community, supporting technology innovation to meet the needs of society. Chapter helps to build an open, flexible and global knowledge network supported by individuals, companies and institutions and facilitated by the IET and its members. It focusses on interaction and sharing of knowledge in the fields of science and engineering. The chapter is a students’ representative group in VIT of Europe’s largest and the World’s second largest professional society dedicated to sharing and spreading global technical and technological knowledge to help the student’s standout in their careers.",
        "img_path": "IET.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "website": "https://ietvit.tech/",
            "linkedin": "https://in.linkedin.com/company/ietvit",
            "instagram": "https://www.instagram.com/ietvit/?hl=en"
        }
    },
    {
        "serial": 144,
        "name": "THE INSTRUMENT SOCIETY OF INDIA (ISOI)",
        "description": "The Instrument Society of India (ISOI) strives to act as a link between academic institutions and the instrumentation industry, by organising several programs. It also conducts programs for students and working professionals in the form of short term courses, symposia and topical reviews. Society objectives: To provide a forum for pooling the knowledge and experience of individuals, participants from scientific institutions and industrial organizations interested in promoting development of instruments and instrumentation systems. To act as an exchange bureau for dissemination of technical information by way of periodic and special publications, appraising the technical and scientific personnel in the industries as well as in research institutions, of the requirements in the field of instrumentation by the industries and the educational and scientific institutions mutually. To organize liaison between interested entrepreneurs with technical problems in their instrumentation activities and the experts who offer to act as consultants and to engage in such activities as shall contribute towards promoting instrumentation activities.",
        "img_path": "ISOI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/isoi.vit/?hl=en",
            "facebook": "https://www.facebook.com/isoivit/",
            "linkedin": "https://in.linkedin.com/company/instrument-society-of-india-isoi-vit-vellore"
        }
    },
    {
        "serial": 145,
        "name": "THE SCIENTIFIC RESEARCH SOCIETY (SIGMA XI)",
        "description": "Sigma Xi chapters are found wherever scientific research is undertaken in universities, colleges, industrial research facilities and government laboratories. The chapter honor scientific accomplishments, to encourage and to enhance the worldwide appreciation and support of original investigation in science and technology, and to foster worldwide a creative and dynamic interaction among science, technology and society. To enhance a healthy research enterprise, foster integrity in science and engineering and promote the public's understanding of science for the purpose of improving the human condition. SIGMA XI is a research based student driven chapter which encourages students to carry out research. SIGMAXI conducts research based events regularly which primarily focuses on the latest advances in technology.",
        "img_path": "SIGMA XI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/sigma-xi-vit",
            "instagram": "https://www.instagram.com/sigmaxi.vit/",
            "youtube": "https://youtube.com/@sigmaxithescientificresear6084"
        }
    },
    {
        "serial": 146,
        "name": "THE SOCIETY OF PETROLEUM ENGINEERS (SPE)",
        "description": "The Society of Petroleum Engineers (SPE) chapter at VIT Vellore is a student-led community dedicated to advancing knowledge and innovation in the oil and gas industry. The chapter connects aspiring petroleum engineers through workshops, technical sessions, and industry interactions that cover exploration, drilling, production, and reservoir management. SPE at VIT provides a platform for students to develop professional skills, stay updated on energy sector trends, and prepare for impactful careers in the dynamic world of petroleum engineering.",
        "img_path": "SPE.jpg",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/spe_vit/?hl=en",
            "linkedin": "https://in.linkedin.com/company/society-of-petroleum-engineers-vit",
            "facebook": "https://www.facebook.com/spevit/"
        }
    },
    {
        "serial": 147,
        "name": "TOASTMASTERS INTERNATIONAL",
        "description": "Toastmasters International (TMI) is the leading movement devoted to making effective oral communication a worldwide reality. Learn the arts of speaking, listening, and thinking – vital skills that promote self-actualization, enhance leadership potential, foster human understanding, and contribute to the betterment of mankind. Improve their communication and leadership skills, and find the courage to change. Members are mentored to become better speakers by regularly practicing public speaking skills. The motto of Toastmasters International is \"where leaders are made\", and T we help the members explore leadership opportunities by letting them head a team 6 months after them being inducted. We have organize various national and international conferences and the Toastmasters of VIT have won several competitions in these conferences.",
        "img_path": "TMI.jpg",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/toastmastersvit/?hl=en",
            "facebook": "https://www.facebook.com/toastmastersvit/"
        }
    },
    {
        "serial": 148,
        "name": "VIT MATHEMATICAL ASSOCIATION (VITMAS)",
        "description": "VIT Mathematical Association's student chapter is aimed at empowering students by extending their boundaries of understanding and equipping them with the knowledge and skill to appreciate the most powerful tool in the world - Mathematics. We hope to achieve our aim of improving the understanding of mathematics among the student population of VIT through a program of research-based learning and change how Mathematics is taught and learned. In simpler terms, VITMAS seeks to rekindle students’ love for numbers with events and workshops to enliven mathematics for the skeptics, strategies to understand probabilities and forecasts of industries and with an ambition to take mathematics beyond classrooms.",
        "img_path": "VITMAS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/in/vitmas",
            "instagram": "https://www.instagram.com/vitmas_/?hl=en",
            "facebook": "https://www.facebook.com/vitmasstudentchapter/"
        }
    },
    {
        "serial": 149,
        "name": "INDIAN SOCIETY OF EARTHQUAKE TECHNOLOGY(ISET)",
        "description": "Indian Society for Earthquake Technology (ISET) is a forum dealing with various aspects of earthquake engineering. It is also engaged in various activities directed towards creation of awareness about earthquake and earthquake engineering in general -public as well as scientific/engineering communities. The Society also organizes short term training courses dealing with earthquake technology from time to time. The aims and objectives of the Society are as follows: To promote research, development and awareness work in the field of Earthquake Technology. To provide necessary forum for scientists and engineers of various specializations to come together and exchange ideas on the problems of Earthquake Technology. To disseminate knowledge in the field of Earthquake Technology dealing with scientific and engineering aspects. To honour pioneering and meritorious contributions in- the field of Earthquake Technology.",
        "img_path": "ISET.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/iset_vit/"
        }
    },
    {
        "serial": 150,
        "name": "IEEE ELECTROMAGENETIC COMPATIBILITY SOCIETY (IEEE-EMCS)",
        "description": "The IEEE Electromagnetic Compatibility Society (IEEE-EMCS), founded in 1957 is the world's largest organization dedicated to the development and distribution of information, tools, and techniques for reducing electromagnetic interference (EMI). The society's field of interest includes standards, measurement techniques and test procedures, instrumentation, equipment and systems characteristics, interference control techniques and components, education, computational analysis, and spectrum management. The members will get the opportunity to network with the top minds in the field which helps for the success in the career.",
        "img_path": "IEEE Electromagnetic Compatibility Society (IEEE-EMCS).webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "instagram": "https://www.instagram.com/ieeeemcsvit/"
        }
    },
    {
        "serial": 151,
        "name": "INDIAN GEOTECHNICAL SOCIETY",
        "description": "Indian Geotechnical Society (IGS) has expanded its roots to establish a student chapter at VIT! Established in 1948, IGS aims to bring together engineers and researchers interested in the fields of Soil Mechanics, Foundation Engineering, Engineering Geology, Rock Mechanics, and allied fields; in order to discuss practical applications, technological advancements, and innovations in these domains. The student chapter seeks to conduct webinars, hold debates, conduct quizzes along with events to bring out the inner geotechnical engineer in you.",
        "img_path": "IGS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "instagram": "https://www.instagram.com/igs.vit_/",
            "linkedin": "https://in.linkedin.com/company/igs-vellore"
        }
    },
    {
        "serial": 152,
        "name": "THE INDIAN SOCIETY OF HEATING, REFRIGERATING AND AIR CONDITIONING ENGINEERS (ISHRAE)",
        "description": "The Indian Society of Heating, Refrigerating and Air Conditioning Engineers (ISHRAE), was founded in 1981 at New Delhi by a group of eminent HVAC&R professionals. ISHRAE today has HVAC&R professionals and Student-members. ISHRAE operates from Chapters and sub-Chapters spread all over India, with HQ in Delhi. It is led by a team of elected officers, who are members of the Society, working on a voluntary basis, and collectively called the Board of Governors. ISHRAE aims to promote the goals of the Society for the benefit of the general public. Towards this objective, the Chapters of the Society participate in, and organize, activities to protect the Environment, improve Indoor Air Quality, help Energy Conservation, provide continuing education to the Members and others in the HVAC & related user Industries and offer certification programs, career guidance to students. ISHRAE conducts Conferences, Seminars, Exhibitions, Workshops, Panel Discussions and Product Presentations throughout the country with both national and international participants to discuss, promote and display the state-of-the-art technologies, systems, products and services.",
        "img_path": "ISHRAE.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ishrae-vit",
            "instagram": "https://www.instagram.com/ishrae_vit/?hl=en"
        }
    },
    {
        "serial": 153,
        "name": "IEEE ELECTRON DEVICES SOCIETY (IEEE-EDS)",
        "description": "IEEE Electron Devices Society (IEEE-EDS) Vision Statement: Promoting excellence in the field of electron devices for the benefit of humanity. Mission Statement: To foster professional growth of its members by satisfying their needs for easy access to and exchange of technical information, publishing, education, and technical recognition and enhancing public visibility in the field of Electron Devices. The field of interest for EDS includes all electron and ion based devices, in their classical or quantum states, using environments and materials in their lowest to highest conducting phase, in simple or engineered assembly, interacting with and delivering photo-electronic, electro-magnetic, electromechanical, electro-thermal, and bio-electronic signals. The Society sponsors and reports on education, research, development and manufacturing aspects and is involved in science, theory, engineering, experimentation, simulation, modeling, design, fabrication, interconnection, reliability of such devices and their applications.",
        "img_path": "IEEE - EDS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "instagram": "https://www.instagram.com/ieeeedsvit/",
            "linkedin": "https://in.linkedin.com/company/ieeeedsvit"
        }
    },
    {
        "serial": 154,
        "name": "IEEE PRODUCT SAFETY ENGINEERING SOCIETY (IEEE-PSES)",
        "description": "IEEE Product Safety Engineering Society (IEE-PSES) is a society to serve the product safety and regulatory profession and the public, by fostering the development and facilitation of the exchange of knowledge in the disciplines of product safety and compliance engineering (PS&CE), as detailed in the PSES's field of interest (FOI), and promote scientific, literary, educational and professional aspects thereof, that benefit members, the profession and humanity. Our Vision is to be recognized as the respected innovator and global resource for scientific, technological and engineering information and services in the disciplines of product safety and compliance engineering for the betterment of society, and to be the preferred professional development source for our members.",
        "img_path": "IEEE - PSES.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "facebook": "https://www.facebook.com/ieeepsesvit/",
            "linkedin": "https://in.linkedin.com/in/ieee-pses-vit-6846a016a"
        }
    },
    {
        "serial": 155,
        "name": "MATERIAL ADVANTAGE STUDENT CHAPTER (ASM)",
        "description": "Material Advantage Student Chapter (ASM) The Student chapter under ASM International is the preeminent association for engaging and connecting materials professionals and their organizations to the resources necessary to solve problems, improve outcomes, and advance society. As the world's largest and most established materials information society, ASM engages and connects you to a global network of peers and provides access to trusted materials information through reference content and data, education courses, international events, and research. Chapter provides various opportunities for student personal development, career resources, information resources, future opportunities and long term benefits of building your career foundation in materials science and engineering. The chapter has a unique opportunity for all the students irrespective of their degree. Student of undergraduate, postgraduate and also the research scholar can be a part of the chapter.",
        "img_path": "ASM.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "linkedin": "https://in.linkedin.com/in/material-advantage-vit-vellore-8b39aa303"
        }
    },
    {
        "serial": 156,
        "name": "SOLAR ENERGY SOCIETY OF INDIA (SESI)",
        "description": "The Solar Energy of India (SESI), established in 1978, having its Secretariat in New Delhi, is the Indian Section of the International Solar Energy Society (ISES). Its interests cover all aspects of renewable energy, including characteristics, effects and methods of use, and it provides a common ground to all those concerned with the nature and utilization of this renewable non-polluting resource.",
        "img_path": "SESI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/sesi-vit",
            "instagram": "https://www.instagram.com/sesi.vit/"
        }
    },
    {
        "serial": 157,
        "name": "INTERACTION DESIGN ASSOCIATION",
        "description": "The Interaction Design Association (IxDA) chapter at VIT Vellore is a vibrant community focused on the art and science of designing intuitive and engaging user experiences. The chapter brings together students passionate about user interface design, human-computer interaction, and usability to collaborate on projects, workshops, and discussions. By exploring the latest trends and best practices in interaction design, IxDA empowers members to create meaningful digital experiences that seamlessly connect people and technology.",
        "img_path": "IXDA.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INTERNATIONAL",
        "socials": {
            "instagram": "https://www.instagram.com/ixda_vit/",
            "linkedin": "https://in.linkedin.com/company/ixda-vellore"
        }
    },
    {
        "serial": 158,
        "name": "IEEE INFORMATION THEORY SOCIETY ( IEEE ITS)",
        "description": "The IEEE Information Theory Society is an international association whose objective is to connect people who are interested in the aspects of coding. It is the premier professional society dedicated to advancing the mathematical underpinnings of Information Technology for the benefit of humanity. As a part of the most significant technical professional association, we provide our members with many opportunities, including coding competitions, publishing journals, participating in conferences, and supporting student activities and the local chapter.",
        "img_path": "IEEE-ITS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieee-its-landing.vercel.app/",
            "linkedin": "https://ieee-its-landing.vercel.app/"
        }
    },
    {
        "serial": 159,
        "name": "INDIAN CONCRETE INSTITUTE",
        "description": "The Genesis of Indian Concrete Institute (ICI) dates back to the year 1982, by the initiatives of VIT Vellore, ICI Students Chapter was established for the benefit of students. Through the Chapter, we aim to bridge the gap between theoretical knowledge and practicality, encourage students to attend and organize conferences, workshops, training programmes, etc., to promote growth of concrete construction and its innovation, to identify R&D problems in practical relevance of infrastructure using concrete in construction, and thus to contribute in creating a better understanding of concrete construction technology.",
        "img_path": "ICI.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {
            "linkedin": "https://in.linkedin.com/company/ici-vit",
            "instagram": "https://www.instagram.com/ici_vit/"
        }
    },
    {
        "serial": 160,
        "name": "IEEE - POWER ELECTRONICS SOCIETY (IEEE - PELS)",
        "description": "The Power Electronics Society (IEEE-PELS) is one of the fastest-growing technical societies of the Institute of Electrical and Electronics Engineers (IEEE). For over 30 years, PELS has facilitated and guided the development and innovation in power electronics technology. This technology encompasses the effective use of electronic components, the application of circuit theory and design techniques, and the development of analytical tools for efficient conversion, control, and condition of electric power.",
        "img_path": "IEEE-PELS.webp",
        "asc_type": "CHAPTER",
        "chapter_type": "IEEE",
        "socials": {
            "website": "https://ieee-pelsvitv.vercel.app/",
            "instagram": "https://www.instagram.com/ieeepels_vitvellore/",
            "linkedin": "https://in.linkedin.com/company/ieee-pels-vitv"
        }
    },
    {
        "serial": 161,
        "name": "NATIONAL ASSOCIATION OF STUDENTS OF ARCHITECTURE (NASA)",
        "description": "The National Association of Students of Architecture in India (NASA) is the world's largest network of architecture students, with more than 100,000 members from over 500 institutions across India.",
        "img_path": "NASA.jpg",
        "asc_type": "CHAPTER",
        "chapter_type": "INDIAN",
        "socials": {}
    }
]